OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_uja113x/include/sbc_uja113x_map.h
/*
 * Copyright 2017 NXP
 * All rights reserved.
 *
 * NXP Confidential. This software is owned or controlled by NXP and may only be
 * used strictly in accordance with the applicable license terms. By expressly
 * accepting such terms or by downloading, installing, activating and/or otherwise
 * using the software, you are agreeing that you have read, and that you agree to
 * comply with and are bound by, such license terms. If you do not agree to be
 * bound by the applicable license terms, then you may not retain, install,
 * activate or otherwise use the software. The production use license in
 * Section 2.3 is expressly granted for this software.
 */

/*!
 * @sbc_uja113x_map.h
 *
 * @page misra_violations MISRA-C:2012 violations
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Directive 4.9, Function-like macro defined
 * This is required to allow the use of a macro for shifting and masking
 * uint8_t type values only.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.5, Macro not referenced
 * Macros which are not currently referenced in code but can be used in the
 * future or by user.
 */

#ifndef SOURCES_SBC_UJA113X_MAP_H_
#define SOURCES_SBC_UJA113X_MAP_H_

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/*! TODO
 * @brief  Register address macros.
 */
#define UJA113X_REG_ADDR_MASK                (0xFEU)
#define UJA113X_REG_ADDR_SHIFT               (1U)
#define UJA113X_REG_ADDR_F(x)                ((uint8_t)((uint8_t)(x)<<UJA113X_REG_ADDR_SHIFT)&UJA113X_REG_ADDR_MASK)


/*******************************************************************************
 * Primary control registers (0x00 - 0x0F)
 ******************************************************************************/

/*******************************************************************************
 * System interrupt enable register (0x04)
 ******************************************************************************/
/*!
 * @brief System interrupt enable register, overtemperature warning interrupt
 * enable macros.
 */
#define UJA113X_SYSIE_OTWIE_MASK        (0x04U)
#define UJA113X_SYSIE_OTWIE_SHIFT       (2U)
#define UJA113X_SYSIE_OTWIE_F(x)        ((uint8_t)((uint8_t)(x) << UJA113X_SYSIE_OTWIE_SHIFT) & \
										UJA113X_SYSIE_OTWIE_MASK)

/*!
 * @brief System interrupt enable register, SPI failure enable.
 */
#define UJA113X_SYSIE_SPIFIE_MASK       (0x02U)
#define UJA113X_SYSIE_SPIFIE_SHIFT      (1U)
#define UJA113X_SYSIE_SPIFIE_F(x)       ((uint8_t)((uint8_t)(x) << UJA113X_SYSIE_SPIFIE_SHIFT) & \
										UJA113X_SYSIE_SPIFE_MASK)

/*!
 * @brief System interrupt enable register.
 */
#define UJA113X_SYSIE_MASK              (UJA113X_SYSIE_OTWIE_MASK | UJA113X_SYSIE_SPIFIE_MASK)
#define UJA113X_SYSIE_SHIFT             (1U)
#define UJA113X_SYSIE_F(x)              ((uint8_t)((uint8_t)(x) << UJA113X_SYSIE_SHIFT) & \
										UJA113X_SYSIE_MASK)

/*!
 * @brief Mode control register, mode control macros.
 */
#define UJA113X_MC_MC_MASK            	(0x07U)
#define UJA113X_MC_MC_SHIFT           	(0U)
#define UJA113X_MC_MC_F(x)            	((uint8_t)((uint8_t)(x) << UJA113X_MC_MC_SHIFT) & \
										UJA113X_MC_MC_MASK)
/*!
 * @brief Main status register, overtemperature warning status macros.
 */
#define UJA113X_MSS_OTWS_MASK          	(0x40U)
#define UJA113X_MSS_OTWS_SHIFT         	(6U)
#define UJA113X_MSS_OTWS_F(x)          	((uint8_t)((uint8_t)(x) << UJA113X_MSS_OTWS_SHIFT) & \
										UJA113X_MSS_OTWS_MASK)

/*!
 * @brief Main status register, Normal mode status macros.
 */
#define UJA113X_MSS_NMS_MASK           	(0x20U)
#define UJA113X_MSS_NMS_SHIFT          	(5U)
#define UJA113X_MSS_NMS_F(x)           	((uint8_t)((uint8_t)(x) << UJA113X_MSS_NMS_SHIFT) & \
										UJA113X_MSS_NMS_MASK)

/*!
 * @brief Main status register, Reset source status macros.
 */
#define UJA113X_MSS_RSS_MASK           	(0x1FU)
#define UJA113X_MSS_RSS_SHIFT          	(0U)
#define UJA113X_MSS_RSS_F(x)           	((uint8_t)((uint8_t)(x) << UJA113X_MSS_RSS_SHIFT) & \
										UJA113X_MSS_RSS_MASK)

/*!
 * @brief Main status register macros.
 */
#define UJA113X_MSS_MASK                (UJA113X_MAIN_OTWS_MASK | UJA113X_MAIN_NMS_MASK | \
										UJA113X_MAIN_RSS_MASK)
#define UJA113X_MSS_SHIFT               (0U)
#define UJA113X_MSS_F(x)                ((uint8_t)((uint8_t)(x) << UJA113X_MAIN_SHIFT) & \
										UJA113X_MAIN_MASK)

/*!
 * @brief Watchdog control register, watchdog mode control macros.
 */
#define UJA113X_WDC_WMC_MASK           	(0xE0U)
#define UJA113X_WDC_WMC_SHIFT          	(5U)
#define UJA113X_WTDOG_CTR_WMC_F(x)      ((uint8_t)((uint8_t)(x) << UJA113X_WDC_WMC_SHIFT) & \
										UJA113X_WDC_WMC_MASK)

/*!
 * @brief Watchdog control register, nominal watchdog period macros.
 */
#define UJA113X_WDC_NWP_MASK           	(0x0FU)
#define UJA113X_WDC_NWP_SHIFT          	(0U)
#define UJA113X_WDC_NWP_F(x)           	((uint8_t)((uint8_t)(x) << UJA113X_WDC_NWP_SHIFT) & \
										UJA113X_WDC_NWP_MASK)

/*!
 * @brief Watchdog control register macros.
 */
#define UJA113X_WDC_MASK               	(UJA113X_WDC_WMC_MASK | UJA113X_WDC_NWP_MASK)
#define UJA113X_WDC_SHIFT              	(0U)
#define UJA113X_WDC_F(x)               	((uint8_t)((uint8_t)(x) << UJA113X_WDC_SHIFT) & \
										UJA113X_WTDOG_CTR_MASK)

/*!
 * @brief Watchdog status register, forced Normal mode status macros.
 */
#define UJA113X_WDS_FNMS_MASK         	(0x08U)
#define UJA113X_WDS_FNMS_SHIFT        	(3U)
#define UJA113X_WDS_FNMS_F(x)         	((uint8_t)((uint8_t)(x) << UJA113X_WDS_FNMS_SHIFT) & \
										UJA113X_WDS_FNMS_MASK)

/*!
 * @brief Watchdog status register, Software Development mode status macros.
 */
#define UJA113X_WDS_SDMS_MASK         	(0x04U)
#define UJA113X_WDS_SDMS_SHIFT        	(2U)
#define UJA113X_WDS_SDMS_F(x)         	((uint8_t)((uint8_t)(x) << UJA113X_WDS_SDMS_SHIFT) & \
										UJA113X_WTDOG_STAT_SDMS_MASK)

/*!
 * @brief Watchdog status register, watchdog status macros.
 */
#define UJA113X_WDS_WDS_MASK          	(0x03U)
#define UJA113X_WDS_WDS_SHIFT         	(0U)
#define UJA113X_WDS_WDS_F(x)          	((uint8_t)((uint8_t)(x) << UJA113X_WDS_WDS_SHIFT) & \
										UJA113X_WTDOG_STAT_WDS_MASK)

/*!
 * @brief Watchdog status register macros.
 */
#define UJA113X_WDS_MASK              	(UJA113X_WDS_FNMS_MASK | UJA113X_WDS_SDMS_MASK | \
                                        UJA113X_WDS_WDS_MASK)
#define UJA113X_WDS_SHIFT             	(0U)
#define UJA113X_WDS_F(x)              	((uint8_t)((uint8_t)(x) << UJA113X_WDS_SHIFT) & \
										UJA113X_WDS_MASK)

/*!
 * @brief Fail-safe control register, EN shut-down control macros.
 */
#define UJA113X_FSC_ENSC_MASK      		(0xC0U)
#define UJA113X_FSC_ENSC_SHIFT     		(6U)
#define UJA113X_FSC_ENSC_F(x)      		((uint8_t)((uint8_t)(x) << UJA113X_FSC_ENSC_SHIFT) & \
										UJA113X_FSC_ENSC_MASK)

/*!
 * @brief Fail-safe control register, EN high-side driver activation macros.
 */
#define UJA113X_FSC_ENDC_MASK      		(0x20U)
#define UJA113X_FSC_ENDC_SHIFT     		(5U)
#define UJA113X_FSC_ENDC_F(x)      		((uint8_t)((uint8_t)(x) << UJA113X_FSC_ENDC_SHIFT) & \
										UJA113X_FSC_ENDC_MASK)

/*!
 * @brief Fail-safe control register, EN output configuration macros.
 */
#define UJA113X_FSC_ENC_MASK      		(0x18U)
#define UJA113X_FSC_ENC_SHIFT     		(3U)
#define UJA113X_FSC_ENC_F(x)      		((uint8_t)((uint8_t)(x) << UJA113X_FSC_ENC_SHIFT) & \
										UJA113X_FSC_ENC_MASK)

/*!
 * @brief Fail-safe control register, LIMP home control macros.
 */
#define UJA113X_FSC_LHC_MASK      		(0x04U)
#define UJA113X_FSC_LHC_SHIFT     		(2U)
#define UJA113X_FSC_LHC_F(x)      		((uint8_t)((uint8_t)(x) << UJA113X_FSC_LHC_SHIFT) & \
										UJA113X_FSC_LHC_MASK)

/*!
 * @brief  Fail-safe control register, reset counter control macros.
 */
#define UJA113X_FSC_RCC_MASK      		(0x03U)
#define UJA113X_FSC_RCC_SHIFT     		(0U)
#define UJA113X_FSC_RCC_F(x)      		((uint8_t)((uint8_t)(x) << UJA113X_FAIL_SAFE_RCC_SHIFT) & \
										UJA113X_FAIL_SAFE_RCC_MASK)

/*!
 * @brief  Fail-safe control register macros.
 */
#define UJA113X_FSC_MASK               	(UJA113X_FSC_LHC_MASK | UJA113X_FSC_RCC_MASK | \
										UJA113X_FSC_ENSC_MASK | UJA113X_FSC_ENDC_MASK | \
										UJA113X_FSC_ENC_MASK)
#define UJA113X_FSC_SHIFT              	(0U)
#define UJA113X_FSC_F(x)               	((uint8_t)((uint8_t)(x)<<UJA113X_FAIL_SAFE_SHIFT)&UJA113X_FAIL_SAFE_MASK)

