OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_uja113x/include/sbc_uja113x_map.h
/*******************************************************************************
 * Lock control register (0x0A)
 ******************************************************************************/
/*!
 * @brief  Lock control 6: address area 0x68 to 0x6F macros.
 */
#define UJA113X_LC_LK6C_MASK            (0x40U)
#define UJA113X_LC_LK6C_SHIFT           (6U)
#define UJA113X_LC_LK6C_F(x)            ((uint8_t)((uint8_t)(x) << UJA113X_LC_LK6C_SHIFT) & \
										UJA113X_LC_LK6C_MASK)

/*!
 * @brief  Lock control control 5: address area 0x50 to 0x5F - Timer control macros.
 */
#define UJA113X_LC_LK5C_MASK            (0x20U)
#define UJA113X_LC_LK5C_SHIFT           (5U)
#define UJA113X_LC_LK5C_F(x)            ((uint8_t)((uint8_t)(x) << UJA113X_LC_LK5C_SHIFT) & \
										UJA113X_LC_LK5C_MASK)

/*!
 * @brief  Lock control 4: address area 0x40 to 0x4F - HVIO5 to HVIO8 control macros.
 */
#define UJA113X_LC_LK4C_MASK            (0x10U)
#define UJA113X_LC_LK4C_SHIFT           (4U)
#define UJA113X_LC_LK4C_F(x)            ((uint8_t)((uint8_t)(x) << UJA113X_LC_LK4C_SHIFT) & \
										UJA113X_LC_LK4C_MASK)

/*!
 * @brief  Lock control 3: address area 0x30 to 0x3F - address area 0x30 to
 * 0x3F - HVIO1 to HVIO4 control macros.
 */
#define UJA113X_LC_LK3C_MASK            (0x08U)
#define UJA113X_LC_LK3C_SHIFT           (3U)
#define UJA113X_LC_LK3C_F(x)            ((uint8_t)((uint8_t)(x) << UJA113X_LC_LK3C_SHIFT) & \
										UJA113X_LC_LK3C_MASK)

/*!
 * @brief  Lock control 2: address area 0x20 to 0x2F - transceiver control macros.
 */
#define UJA113X_LC_LK2C_MASK            (0x04U)
#define UJA113X_LC_LK2C_SHIFT           (2U)
#define UJA113X_LC_LK2C_F(x)            ((uint8_t)((uint8_t)(x) << UJA113X_LC_LK2C_SHIFT) & \
										UJA113X_LC_LK2C_MASK)

/*!
 * @brief  Lock control 1: address area 0x10 to 0x1F - supply control macros.
 */
#define UJA113X_LC_LK1C_MASK            (0x02U)
#define UJA113X_LC_LK1C_SHIFT           (1U)
#define UJA113X_LC_LK1C_F(x)            ((uint8_t)((uint8_t)(x) << UJA113X_LC_LK1C_SHIFT) & \
										UJA113X_LC_LK1C_MASK)

/*!
 * @brief  Lock control 0: address area 0x06 to 0x09 - general-purpose memory macros.
 */
#define UJA113X_LC_LK0C_MASK            (0x01U)
#define UJA113X_LC_LK0C_SHIFT           (0U)
#define UJA113X_LC_LK0C_F(x)            ((uint8_t)((uint8_t)(x) << UJA113X_LC_LK0C_SHIFT) & \
										UJA113X_LC_LK0C_MASK)

/*!
 * @brief  Lock control register macros.
 */
#define UJA113X_LC_MASK               	(UJA113X_LC_LK0C_MASK | UJA113X_LC_LK1C_MASK | \
                                         UJA113X_LC_LK2C_MASK | UJA113X_LC_LK3C_MASK | \
										                     UJA113X_LC_LK4C_MASK | UJA113X_LC_LK5C_MASK | \
										                     UJA113X_LC_LK6C_MASK)
#define UJA113X_LC_SHIFT              	(0U)
#define UJA113X_LC_F(x)               	((uint8_t)((uint8_t)(x) << UJA113X_LC_SHIFT) & \
										UJA113X_LC_MASK)

/*******************************************************************************
 * Supply control registers (0x10 - 0x1F)
 ******************************************************************************/

/*******************************************************************************
 * Regulator control register (0x10)
 ******************************************************************************/
/*!
 * @brief Regulator control register, V2 shutdown response to a battery
 * over- or undervoltage macros.
 */
#define UJA113X_RC_V2SC_MASK           	(0x30U)
#define UJA113X_RC_V2SC_SHIFT          	(4U)
#define UJA113X_RC_V2SC_F(x)           	((uint8_t)((uint8_t)(x) << UJA113X_RC_V2SC_SHIFT) & \
										UJA113X_RC_V2SC_MASK)

/*!
 * @brief Regulator control register, V2 control macros.
 */
#define UJA113X_RC_V2C_MASK           	(0x0CU)
#define UJA113X_RC_V2C_SHIFT          	(2U)
#define UJA113X_RC_V2C_F(x)           	((uint8_t)((uint8_t)(x) << UJA113X_RC_V2C_SHIFT) & \
										UJA113X_RC_V2C_MASK)

/*!
 * @brief Regulator control register, V1 undervoltage reset threshold macros.
 */
#define UJA113X_RC_V1RTC_MASK         	(0x03U)
#define UJA113X_RC_V1RTC_SHIFT       	(0U)
#define UJA113X_RC_V1RTC_F(x)         	((uint8_t)((uint8_t)(x)<<UJA113X_RC_V1RTC_SHIFT) & \
										UJA113X_REGULATOR_V1RTC_MASK)

/*!
 * @brief Regulator control register macros.
 */
#define UJA113X_RC_MASK               	(UJA113X_RC_V2SC_MASK | UJA113X_RC_V2C_MASK | \
										UJA113X_RC_V1RTC_MASK)
#define UJA113X_RC_SHIFT              	(0U)
#define UJA113X_RC_F(x)               	((uint8_t)((uint8_t)(x) << UJA113X_RC_SHIFT) & \
										UJA113X_RC_MASK)

/*******************************************************************************
 * Battery monitor event trigger source control register (0x11)
 ******************************************************************************/
/*!
 * @brief Battery monitor event trigger source control register, trigger source
 * for generating battery monitoring/overvoltage/undervoltage/shutdown events.
 */
#define UJA113X_BMETSC_BMSC_MASK        (0x01U)
#define UJA113X_BMETSC_BMSC_SHIFT       (0U)
#define UJA113X_BMETSC_BMSC_F(x)        ((uint8_t)((uint8_t)(x) << UJA113X_BMETSC_BMSC_SHIFT) & \
										UJA113X_BMETSC_BMSC_MASK)

/*!
 * @brief Battery monitor event trigger source control register macros.
 */
#define UJA113X_BMETSC_MASK             (UJA113X_BMETSC_BMSC_MASK)
#define UJA113X_BMETSC_SHIFT            (0U)
#define UJA113X_BMETSC_F(x)             ((uint8_t)((uint8_t)(x) << UJA113X_BMETSC_SHIFT) & \
										UJA113X_BMETSC_MASK)

/*******************************************************************************
 * Battery monitor undervoltage threshold control register (0x12)
 ******************************************************************************/
/*!
 * @brief Battery monitor undervoltage threshold control register, threshold
 * for triggering a battery undervoltage event and BMUI interrupt.
 */
#define UJA113X_BMUTC_BMUTC_MASK        (0xFFU)
#define UJA113X_BMUTC_BMUTC_SHIFT       (0U)
#define UJA113X_BMUTC_BMUTC_F(x)        ((uint8_t)((uint8_t)(x) << UJA113X_BMUTC_BMUTC_SHIFT) & \
										UJA113X_BMUTC_BMUTC_MASK)

/*!
 * @brief Battery monitor event trigger source control register macros.
 */
#define UJA113X_BMUTC_MASK             	(UJA113X_BMUTC_BMUTC_MASK)
#define UJA113X_BMUTC_SHIFT            	(0U)
#define UJA113X_BMUTC_F(x)             	((uint8_t)((uint8_t)(x) << UJA113X_BMUTC_BMUTC_SHIFT) & \
										UJA113X_BMUTC_BMUTC_MASK)

