OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_uja113x/include/sbc_uja113x_map.h
/*******************************************************************************
 * Battery monitor overvoltage threshold control register (0x13)
 ******************************************************************************/
/*!
 * @brief Battery monitor overvoltage threshold control register, threshold
 * for triggering a battery overvoltage event and BMOI interrupt.
 */
#define UJA113X_BMOTC_BMOTC_MASK        (0xFFU)
#define UJA113X_BMOTC_BMOTC_SHIFT       (0U)
#define UJA113X_BMOTC_BMOTC_F(x)        ((uint8_t)((uint8_t)(x) << UJA113X_BMOTC_BMOTC_SHIFT) & \
										UJA113X_BMOTC_BMOTC_MASK)

/*!
 * @brief Battery monitor event trigger source control register macros.
 */
#define UJA113X_BMOTC_MASK             	(UJA113X_BMOTC_BMOTC_MASK)
#define UJA113X_BMOTC_SHIFT            	(0U)
#define UJA113X_BMOTC_F(x)             	((uint8_t)((uint8_t)(x) << UJA113X_BMOTC_BMOTC_SHIFT) & \
										UJA113X_BMOTC_BMOTC_MASK)

/*******************************************************************************
 * Battery monitor hysteresis control register (0x14)
 ******************************************************************************/
/*!
 * @brief Battery monitor hysteresis control register, battery monitor
 * overvoltage threshold release level.
 */
#define UJA113X_BMHC_BMHOC_MASK        	(0xF0U)
#define UJA113X_BMHC_BMHOC_SHIFT       	(4U)
#define UJA113X_BMHC_BMHOC_F(x)        	((uint8_t)((uint8_t)(x) << UJA113X_BMHC_BMHOC_SHIFT) & \
										UJA113X_BMHC_BMHOC_MASK)

/*!
 * @brief Battery monitor hysteresis control register, battery monitor
 * undervoltage threshold release level.
 */
#define UJA113X_BMHC_BMHUC_MASK        	(0x0FU)
#define UJA113X_BMHC_BMHUC_SHIFT       	(0U)
#define UJA113X_BMHC_BMHUC_F(x)        	((uint8_t)((uint8_t)(x) << UJA113X_BMHC_BMHUC_SHIFT) & \
										UJA113X_BMHC_BMHUC_MASK)

/*!
 * @brief Battery monitor event trigger source control register macros.
 */
#define UJA113X_BMHC_MASK             	(UJA113X_BMHC_BMHOC_MASK | UJA113X_BMHC_BMHUC_MASK)
#define UJA113X_BMHC_SHIFT            	(0U)
#define UJA113X_BMHC_F(x)             	((uint8_t)((uint8_t)(x) << UJA113X_BMHC_SHIFT) & \
										UJA113X_BMHC_MASK)

/*******************************************************************************
 * ADC conversion results for VBAT register 1 (0x15)
 ******************************************************************************/
/*!
 * @brief ADC conversion results for VBAT register 1, ADC conversion results
 * for voltage measured on pin BAT; 8 most significant bits.
 */
#define UJA113X_ACRVBAT1_BMBCD_MASK     (0xFFU)
#define UJA113X_ACRVBAT1_BMBCD_SHIFT    (0U)
#define UJA113X_ACRVBAT1_BMBCD_F(x)     ((uint8_t)((uint8_t)(x) << UJA113X_ACRVBAT1_BMBCD_SHIFT) & \
										UJA113X_ACRVBAT1_BMBCD_MASK)

/*!
 * @brief ADC conversion results for VBAT register 1 macros.
 */
#define UJA113X_ACRVBAT1_MASK           (UJA113X_ACRVBAT1_BMBCD_MASK)
#define UJA113X_ACRVBAT1_SHIFT          (0U)
#define UJA113X_ACRVBAT1_F(x)           ((uint8_t)((uint8_t)(x) << UJA113X_ACRVBAT1_SHIFT) & \
										UJA113X_ACRVBAT1_MASK)

/*******************************************************************************
 * ADC conversion results for VBAT register 2 (0x16)
 ******************************************************************************/
/*!
 * @brief ADC conversion results for VBAT register 2, ADC conversion results for
 * VBAT read out via SPI.
 */
#define UJA113X_ACRVBAT2_BMBCS_MASK     (0x04U)
#define UJA113X_ACRVBAT2_BMBCS_SHIFT    (2U)
#define UJA113X_ACRVBAT2_BMBCS_F(x)     ((uint8_t)((uint8_t)(x) << UJA113X_ACRVBAT2_BMBCS_SHIFT) & \
										UJA113X_ACRVBAT2_BMBCS_MASK)

/*!
 * @brief ADC conversion results for VBAT register 2, ADC conversion results
 * for voltage measured on pin BAT; 2 least significant bits.
 */
#define UJA113X_ACRVBAT2_BMBCD_MASK     (0x03U)
#define UJA113X_ACRVBAT2_BMBCD_SHIFT    (0U)
#define UJA113X_ACRVBAT2_BMBCD_F(x)     ((uint8_t)((uint8_t)(x) << UJA113X_ACRVBAT2_BMBCD_SHIFT) & \
										UJA113X_ACRVBAT2_BMBCD_MASK)

/*!
 * @brief ADC conversion results for VBATSENSE register 2 macros.
 */
#define UJA113X_ACRVBAT2_MASK           (UJA113X_ACRVBAT2_BMBCS_MASK | UJA113X_ACRVBAT2_BMBCD_MASK)
#define UJA113X_ACRVBAT2_SHIFT          (0U)
#define UJA113X_ACRVBAT2_F(x)           ((uint8_t)((uint8_t)(x) << UJA113X_ACRVBAT_SHIFT) & \
										UJA113X_ACRVBAT_MASK)

/*******************************************************************************
 * ADC conversion results for VBATSENSE register 1 (0x17)
 ******************************************************************************/
/*!
 * @brief ADC conversion results for VBATSENSE register 1, ADC conversion results
 * for voltage measured on pin BAT; 8 most significant bits.
 */
#define UJA113X_ACRVBATSEN1_BMSCD_MASK  (0xFFU)
#define UJA113X_ACRVBATSEN1_BMSCD_SHIFT (0U)
#define UJA113X_ACRVBATSEN1_BMSCD_F(x)  ((uint8_t)((uint8_t)(x) << UJA113X_ACRVBATSEN1_BMSCD_SHIFT) & \
										UJA113X_ACRVBATSEN1_BMSCD_MASK)

/*!
 * @brief ADC conversion results for VBATSENSE register 1 macros.
 */
#define UJA113X_ACRVBATSEN1_MASK        (UJA113X_ACRVBATSEN1_BMSCD_MASK)
#define UJA113X_ACRVBATSEN1_SHIFT       (0U)
#define UJA113X_ACRVBATSEN1_F(x)        ((uint8_t)((uint8_t)(x) << UJA113X_ACRVBATSEN1_SHIFT) & \
										UJA113X_ACRVBATSEN1_MASK)

/*******************************************************************************
 * ADC conversion results for VBATSENSE register 2 (0x16)
 ******************************************************************************/
/*!
 * @brief ADC conversion results for VBATSENSE register 2, ADC conversion results for
 * VBATSENSE read out via SPI.
 */
#define UJA113X_ACRVBATSEN2_BMSCS_MASK  (0x04U)
#define UJA113X_ACRVBATSEN2_BMSCS_SHIFT (2U)
#define UJA113X_ACRVBATSEN2_BMSCS_F(x)  ((uint8_t)((uint8_t)(x) << UJA113X_ACRVBATSEN2_BMSCS_SHIFT) & \
										UJA113X_ACRVBATSEN2_BMSCS_MASK)

/*!
 * @brief ADC conversion results for VBATSENSE register 2, ADC conversion results
 * for voltage measured on pin BATSENSE; 2 least significant bits.
 */
#define UJA113X_ACRVBATSEN2_BMSCD_MASK  (0x03U)
#define UJA113X_ACRVBATSEN2_BMSCD_SHIFT (0U)
#define UJA113X_ACRVBATSEN2_BMSCD_F(x)  ((uint8_t)((uint8_t)(x) << UJA113X_ACRVBATSEN2_BMSCD_SHIFT) & \
										UJA113X_ACRVBATSEN2_BMSCD_MASK)

/*!
 * @brief ADC conversion results for VBATSENSE register 2 macros.
 */
#define UJA113X_ACRVBATSEN2_MASK        (UJA113X_ACRVBATSEN2_BMSCS_MASK | UJA113X_ACRVBATSEN2_BMSCD_MASK)
#define UJA113X_ACRVBATSEN2_SHIFT       (0U)
#define UJA113X_ACRVBATSEN2_F(x)        ((uint8_t)((uint8_t)(x) << UJA113X_ACRVBATSEN2_SHIFT) & \
										UJA113X_ACRVBATSEN2_MASK)

