OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_uja113x/include/sbc_uja113x_map.h
/*******************************************************************************
 * SMPS control register (0x19)
 ******************************************************************************/
/*!
 * @brief SMPS control register, SMPS overtemperature control macros.
 */
#define UJA113X_SMPSC_SMPSOTC_MASK      (0x08U)
#define UJA113X_SMPSC_SMPSOTC_SHIFT     (3U)
#define UJA113X_SMPSC_SMPSOTC_F(x)      ((uint8_t)((uint8_t)(x) << UJA113X_SMPSC_SMPSOTC_SHIFT) & \
										UJA113X_SMPSC_SMPSOTC_MASK)

/*!
 * @brief SMPS control register, SMPS on/off control macros.
 */
#define UJA113X_SMPSC_SMPSC_MASK      	(0x03U)
#define UJA113X_SMPSC_SMPSC_SHIFT     	(0U)
#define UJA113X_SMPSC_SMPSC_F(x)      	((uint8_t)((uint8_t)(x) << UJA113X_SMPSC_SMPSC_SHIFT) & \
										UJA113X_SMPSC_SMPSC_MASK)

/*!
 * @brief Supply voltage status register macros.
 */
#define UJA113X_SMPSC_MASK             	(UJA113X_SMPSC_SMPSOTC_MASK | UJA113X_SMPSC_SMPSC_MASK)
#define UJA113X_SMPSC_SHIFT            	(0U)
#define UJA113X_SMPSC_F(x)             	((uint8_t)((uint8_t)(x) << UJA113X_SMPSC_SHIFT) & \
										UJA113X_SMPSC_MASK)

/*******************************************************************************
 * SMPS output voltage control register (0x1A)
 ******************************************************************************/
/*!
 * @brief SMPS output voltage control register, SMPS output voltage macros.
 */
#define UJA113X_SMPSOVC_SMPOC_MASK      (0x0FU)
#define UJA113X_SMPSOVC_SMPOC_SHIFT     (0U)
#define UJA113X_SMPSOVC_SMPOC_F(x)      ((uint8_t)((uint8_t)(x) << UJA113X_SMPSOVC_SMPOC_SHIFT) & \
										UJA113X_SMPSOVC_SMPOC_MASK)

/*!
 * @brief SMPS output voltage control register macros.
 */
#define UJA113X_SMPSOVC_MASK            (UJA113X_SMPSOVC_SMPOC_MASK)
#define UJA113X_SMPSOVC_SHIFT           (0U)
#define UJA113X_SMPSOVC_F(x)            ((uint8_t)((uint8_t)(x) << UJA113X_SMPSOVC_SHIFT) & \
										UJA113X_SMPSOVC_MASK)

/*******************************************************************************
 * Supply voltage status register (0x1B)
 ******************************************************************************/
/*!
 * @brief Supply voltage status register, overvoltage status of voltage on
 * selected (via BMSC) event trigger source (BAT or BATSENSE) macros.
 */
#define UJA113X_SVS_BMOVS_MASK         	(0x20U)
#define UJA113X_SVS_BMOVS_SHIFT        	(5U)
#define UJA113X_SVS_BMOVS_F(x)         	((uint8_t)((uint8_t)(x) << UJA113X_SVS_BMOVS_SHIFT) & \
										UJA113X_SVS_BMOVS_MASK)

/*!
 * @brief Supply voltage status register, undervoltage status of voltage on
 * selected (via BMSC) event trigger source (BAT or BATSENSE) macros.
 */
#define UJA113X_SVS_BMUVS_MASK         	(0x10U)
#define UJA113X_SVS_BMUVS_SHIFT        	(4U)
#define UJA113X_SVS_BMUVS_F(x)         	((uint8_t)((uint8_t)(x) << UJA113X_SVS_BMUVS_SHIFT) & \
										UJA113X_SVS_BMUVS_MASK)

/*!
 * @brief Supply voltage status register, status of voltage on pin VSMPS macros.
 */
#define UJA113X_SVS_SMPSS_MASK         	(0x08U)
#define UJA113X_SVS_SMPSS_SHIFT        	(3U)
#define UJA113X_SVS_SMPSS_F(x)         	((uint8_t)((uint8_t)(x) << UJA113X_SVS_SMPSS_SHIFT) & \
										UJA113X_SVS_SMPSS_MASK)

/*!
 * @brief Supply voltage status register, VEXT status macros.
 */
#define UJA113X_SVS_VEXTS_MASK         	(0x06U)
#define UJA113X_SVS_VEXTS_SHIFT        	(1U)
#define UJA113X_SVS_VEXTS_F(x)         	((uint8_t)((uint8_t)(x) << UJA113X_SVS_VEXTS_SHIFT) & \
										UJA113X_SVS_VEXTS_MASK)

/*!
 * @brief Supply voltage status register, V1 status macros.
 */
#define UJA113X_SVS_V1S_MASK         	(0x01U)
#define UJA113X_SVS_V1S_SHIFT        	(0U)
#define UJA113X_SVS_V1S_F(x)         	((uint8_t)((uint8_t)(x) << UJA113X_SVS_V1S_SHIFT) & \
										UJA113X_SVS_V1S_MASK)

/*!
 * @brief Supply voltage status register macros.
 */
#define UJA113X_SVS_MASK             	(UJA113X_SVS_V2S_MASK | UJA113X_SVS_V1S_MASK)
#define UJA113X_SVS_SHIFT            	(0U)
#define UJA113X_SVS_F(x)             	((uint8_t)((uint8_t)(x) << UJA113X_SVS_SHIFT) & \
										UJA113X_SVS_MASK)

/*******************************************************************************
 * Supply interrupt enable register (0x1B)
 ******************************************************************************/
/*!
 * @brief Supply interrupt enable register, SMPS status interrupt enable macros.
 */
#define UJA113X_SUPIE_SMPSSIE_MASK      (0x20U)
#define UJA113X_SUPIE_SMPSSIE_SHIFT     (5U)
#define UJA113X_SUPIE_SMPSSIE_F(x)      ((uint8_t)((uint8_t)(x) << UJA113X_SUPIE_SMPSSIE_SHIFT) & \
										UJA113X_SUPIE_SMPSSIE_MASK)

/*!
 * @brief Supply interrupt enable register, battery monitor overvoltage
 * interrupt enable macros.
 */
#define UJA113X_SUPIE_BMOIE_MASK      	(0x10U)
#define UJA113X_SUPIE_BMOIE_SHIFT     	(4U)
#define UJA113X_SUPIE_BMOIE_F(x)      	((uint8_t)((uint8_t)(x) << UJA113X_SUPIE_BMOIE_SHIFT) & \
										UJA113X_SUPIE_BMOIE_MASK)

/*!
 * @brief Supply interrupt enable register, battery monitor undervoltage
 * interrupt enable macros.
 */
#define UJA113X_SUPIE_BMUIE_MASK      	(0x08U)
#define UJA113X_SUPIE_BMUIE_SHIFT     	(3U)
#define UJA113X_SUPIE_BMUIE_F(x)      	((uint8_t)((uint8_t)(x) << UJA113X_SUPIE_BMUIE_SHIFT) & \
										UJA113X_SUPIE_BMUIE_MASK)

/*!
 * @brief Supply interrupt enable register, VEXT overvoltage interrupt enable macros.
 */
#define UJA113X_SUPIE_VEXTOIE_MASK      (0x04U)
#define UJA113X_SUPIE_VEXTOIE_SHIFT     (2U)
#define UJA113X_SUPIE_VEXTOIE_F(x)      ((uint8_t)((uint8_t)(x) << UJA113X_SUPIE_VEXTOIE_SHIFT) & \
										UJA113X_SUPIE_VEXTOIE_MASK)

/*!
 * @brief Supply interrupt enable register, VEXT undervoltage interrupt enable macros.
 */
#define UJA113X_SUPIE_VEXTUIE_MASK      (0x02U)
#define UJA113X_SUPIE_VEXTUIE_SHIFT     (1U)
#define UJA113X_SUPIE_VEXTUIE_F(x)      ((uint8_t)((uint8_t)(x) << UJA113X_SUPIE_VEXTUIE_SHIFT) & \
										UJA113X_SUPIE_VEXTUIE_MASK)

/*!
 * @brief Supply interrupt enable register, V1 undervoltage enable macros.
 */
#define UJA113X_SUPIE_V1UIE_MASK        (0x01U)
#define UJA113X_SUPIE_V1UIE_SHIFT       (0U)
#define UJA113X_SUPIE_V1UIE_F(x)        ((uint8_t)((uint8_t)(x) << UJA113X_SUPIE_V1UIE_SHIFT) & \
										UJA113X_SUPIE_V1UIE_MASK)

/*!
 * @brief Supply interrupt enable register macros.
 */
#define UJA113X_SUPIE_MASK             	(UJA113X_SUPIE_SMPSSIE_MASK| UJA113X_SUPIE_BMOIE_MASK | \
		                               	UJA113X_SUPIE_BMOIE_MASK | UJA113X_SUPIE_BMUIE_MASK | \
										UJA113X_SUPIE_VEXTOIE_MASK | UJA113X_SUPIE_VEXTUIE_MASK | \
									   	UJA113X_SUPIE_V1UIE_MASK)
#define UJA113X_SUPIE_SHIFT            	(0U)
#define UJA113X_SUPIE_F(x)             	((uint8_t)((uint8_t)(x) << UJA113X_SUPIE_SHIFT) & \
										UJA113X_SUPIE_MASK)

