OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_uja113x/include/sbc_uja113x_map.h
/*******************************************************************************
 * Transceiver control registers (0x20 - 0x2F)
 ******************************************************************************/

/*******************************************************************************
 * CAN control register (0x20)
 ******************************************************************************/
/*!
 * @brief CAN control register, CAN FD control macros.
 */
#define UJA113X_CANC_CFDC_MASK          (0x40U)
#define UJA113X_CANC_CFDC_SHIFT         (6U)
#define UJA113X_CANC_CFDC_F(x)          ((uint8_t)((uint8_t)(x) << UJA113X_CANC_CFDC_SHIFT) & \
										UJA113X_CANC_CFDC_MASK)

/*!
 * @brief CAN control register, CAN partial networking configuration OK macros.
 */
#define UJA113X_CANC_PNCOK_MASK         (0x20U)
#define UJA113X_CANC_PNCOK_SHIFT        (5U)
#define UJA113X_CANC_PNCOK_F(x)         ((uint8_t)((uint8_t)(x) << UJA113X_CANC_PNCOK_SHIFT) & \
										UJA113X_CANC_PNCOK_MASK)

/*!
 * @brief  CAN control register, CAN partial networking control macros.
 */
#define UJA113X_CANC_CPNC_MASK          (0x10U)
#define UJA113X_CANC_CPNC_SHIFT         (4U)
#define UJA113X_CANC_CPNC_F(x)          ((uint8_t)((uint8_t)(x) << UJA113X_CANC_CPNC_SHIFT) & \
										UJA113X_CANC_CPNC_MASK)

/*!
 * @brief CAN control register, CAN shut-down control macros.
 */
#define UJA113X_CANC_CSC_MASK          	(0x0CU)
#define UJA113X_CANC_CSC_SHIFT         	(2U)
#define UJA113X_CANC_CSC_F(x)          	((uint8_t)((uint8_t)(x) << UJA113X_CANC_CSC_SHIFT) & \
										UJA113X_CANC_CSC_MASK)

/*!
 * @brief  CAN control register, CAN transceiver operating mode selection macros.
 */
#define UJA113X_CANC_CMC_MASK           (0x03U)
#define UJA113X_CANC_CMC_SHIFT          (0U)
#define UJA113X_CANC_CMC_F(x)           ((uint8_t)((uint8_t)(x) << UJA113X_CANC_CMC_SHIFT) & \
										UJA113X_CANC_CMC_MASK)

/*!
 * @brief  CAN control register macros.
 */
#define UJA113X_CANC_MASK               (UJA113X_CANC_CFDC_MASK | UJA113X_CANC_PNCOK_MASK | \
		                                UJA113X_CANC_CPNC_MASK | UJA113X_CANC_CMC_MASK | \
										UJA113X_CANC_CSC_MASK)
#define UJA113X_CANC_SHIFT              (0U)
#define UJA113X_CANC_F(x)               ((uint8_t)((uint8_t)(x) << UJA113X_CANC_SHIFT) & \
										UJA113X_CANC_MASK)

/*******************************************************************************
 * LIN control register (0x21)
 ******************************************************************************/
/*!
 * @brief LIN control register, LIN2 slope control macros.
 */
#define UJA113X_LINC_LSC2_MASK          (0xC0U)
#define UJA113X_LINC_LSC2_SHIFT         (6U)
#define UJA113X_LINC_LSC2_F(x)          ((uint8_t)((uint8_t)(x) << UJA113X_LINC_LSC2_SHIFT) & \
										UJA113X_LINC_LSC2_MASK)

/*!
 * @brief LIN control register, LIN2 transceiver operating mode selection macros.
 */
#define UJA113X_LINC_LMC2_MASK          (0x30U)
#define UJA113X_LINC_LMC2_SHIFT         (4U)
#define UJA113X_LINC_LMC2_F(x)          ((uint8_t)((uint8_t)(x) << UJA113X_LINC_LMC2_SHIFT) & \
										UJA113X_LINC_LMC2_MASK)

/*!
 * @brief LIN control register, LIN1 slope control macros.
 */
#define UJA113X_LINC_LSC1_MASK          (0x0CU)
#define UJA113X_LINC_LSC1_SHIFT         (2U)
#define UJA113X_LINC_LSC1_F(x)          ((uint8_t)((uint8_t)(x) << UJA113X_LINC_LSC1_SHIFT) & \
										UJA113X_LINC_LSC1_MASK)

/*!
 * @brief LIN control register, LIN1 transceiver operating mode selection macros.
 */
#define UJA113X_LINC_LMC1_MASK          (0x03U)
#define UJA113X_LINC_LMC1_SHIFT         (0U)
#define UJA113X_LINC_LMC1_F(x)          ((uint8_t)((uint8_t)(x) << UJA113X_LINC_LMC1_SHIFT) & \
										UJA113X_LINC_LMC1_MASK)

/*!
 * @brief LIN control register macros.
 */
#define UJA113X_LINC_MASK               (UJA113X_LINC_LSC2_MASK | UJA113X_LINC_LMC2_MASK | \
										UJA113X_LINC_LSC1_MASK | UJA113X_LINC_LMC1_MASK)
#define UJA113X_LINC_SHIFT              (0U)
#define UJA113X_LINC_F(x)               ((uint8_t)((uint8_t)(x) << UJA113X_LINC_SHIFT) & \
										UJA113X_LINC_MASK)

/*******************************************************************************
 * Transceiver status register (0x22)
 ******************************************************************************/
/*!
 * @brief Transceiver status register, CAN transmitter status macros.
 */
#define UJA113X_TS_CTS_MASK          	(0x80U)
#define UJA113X_TS_CTS_SHIFT        	(7U)
#define UJA113X_TS_CTS_F(x)          	((uint8_t)((uint8_t)(x) << UJA113X_TS_CTS_SHIFT) & \
										UJA113X_TS_CTS_MASK)

/*!
 * @brief Transceiver status register, CAN partial networking error macros.
 */
#define UJA113X_TS_CPNERR_MASK       	(0x40U)
#define UJA113X_TS_CPNERR_SHIFT      	(6U)
#define UJA113X_TS_CPNERR_F(x)       	((uint8_t)((uint8_t)(x) << UJA113X_TS_CPNERR_SHIFT) & \
										UJA113X_TRANS_STAT_CPNERR_MASK)

/*!
 * @brief Transceiver status register, CAN partial networking status macros.
 */
#define UJA113X_TS_CPNS_MASK         	(0x20U)
#define UJA113X_TS_CPNS_SHIFT        	(5U)
#define UJA113X_TS_CPNS_F(x)         	((uint8_t)((uint8_t)(x) << UJA113X_TS_CPNS_SHIFT) & \
										UJA113X_TS_CPNS_MASK)

/*!
 * @brief  Transceiver status register, CAN oscillator status macros.
 */
#define UJA113X_TS_COSCS_MASK        	(0x10U)
#define UJA113X_TS_COSCS_SHIFT       	(4U)
#define UJA113X_TS_COSCS_F(x)        	((uint8_t)((uint8_t)(x) << UJA113X_TS_COSCS_SHIFT) & \
										UJA113X_TS_COSCS_MASK)

/*!
 * @brief  Transceiver status register, CAN-bus silence status macros.
 */
#define UJA113X_TS_CBSS_MASK         	(0x08U)
#define UJA113X_TS_CBSS_SHIFT        	(3U)
#define UJA113X_TS_CBSS_F(x)         	((uint8_t)((uint8_t)(x) << UJA113X_TS_CBSS_SHIFT) & \
										UJA113X_TS_CBSS_MASK)

/*!
 * @brief  Transceiver status register, LIN supply status macros.
 */
#define UJA113X_TS_VLINS_MASK         	(0x04U)
#define UJA113X_TS_VLINS_SHIFT        	(2U)
#define UJA113X_TS_VLINS_F(x)         	((uint8_t)((uint8_t)(x) << UJA113X_TS_VLINS_SHIFT) & \
										UJA113X_TS_VLINS_MASK)

/*!
 * @brief  Transceiver status register, CAN supply status macros.
 */
#define UJA113X_TS_VCS_MASK          	(0x02U)
#define UJA113X_TS_VCS_SHIFT         	(1U)
#define UJA113X_TS_VCS_F(x)          	((uint8_t)((uint8_t)(x) << UJA113X_TS_VCS_SHIFT) & \
										UJA113X_TS_VCS_MASK)

/*!
 * @brief  Transceiver status register, CAN failure status macros.
 */
#define UJA113X_TS_CFS_MASK          	(0x01U)
#define UJA113X_TS_CFS_SHIFT         	(0U)
#define UJA113X_TS_CFS_F(x)          	((uint8_t)((uint8_t)(x) << UJA113X_TS_CFS_SHIFT) & \
										UJA113X_TS_CFS_MASK)

/*!
 * @brief  Transceiver status register macros.
 */
#define UJA113X_TS_MASK              	(UJA113X_TS_CTS_MASK | UJA113X_TS_CPNERR_MASK | \
		                                UJA113X_TS_CPNS_MASK | UJA113X_TS_COSCS_MASK | \
										UJA113X_TS_CBSS_MASK | UJA113X_TS_VLINS_MASK | \
										UJA113X_TS_VCS_MASK | UJA113X_TS_CFS_MASK)
#define UJA113X_TS_SHIFT             	(0U)
#define UJA113X_TS_F(x)              	((uint8_t)((uint8_t)(x) << UJA113X_TS_SHIFT) & \
										UJA113X_TS_MASK)

