OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_uja113x/include/sbc_uja113x_map.h
/*******************************************************************************
 * Transceiver interrupt enable register (0x23)
 ******************************************************************************/
/*!
 * @brief Transceiver interrupt enable register, CAN-bus silence interrupt
 * enable macros.
 */
#define UJA113X_TIE_CBSIE_MASK         	(0x10U)
#define UJA113X_TIE_CBSIE_SHIFT        	(4U)
#define UJA113X_TIE_CBSIE_F(x)         	((uint8_t)((uint8_t)(x) << UJA113X_TIE_CBSIE_SHIFT) & \
										UJA113X_TIE_CBSE_MASK)

/*!
 * @brief Transceiver interrupt enable register, LIN2 wake-up interrupt
 * enable macros.
 */
#define UJA113X_TIE_LWI2E_MASK         	(0x08U)
#define UJA113X_TIE_LWI2E_SHIFT        	(3U)
#define UJA113X_TIE_LWI2E_F(x)         	((uint8_t)((uint8_t)(x) << UJA113X_TIE_LWI2E_SHIFT) & \
										UJA113X_TIE_LWI2E_MASK)

/*!
 * @brief Transceiver interrupt enable register, LIN1 wake-up interrupt
 * enable macros.
 */
#define UJA113X_TIE_LWI1E_MASK         	(0x04U)
#define UJA113X_TIE_LWI1E_SHIFT        	(2U)
#define UJA113X_TIE_LWI1E_F(x)         	((uint8_t)((uint8_t)(x) << UJA113X_TIE_LWI1E_SHIFT) & \
										UJA113X_TIE_LWI1E_MASK)

/*!
 * @brief Transceiver interrupt enable register, CAN failure enable interrupt
 * macros.
 */
#define UJA113X_TIE_CFIE_MASK          	(0x02U)
#define UJA113X_TIE_CFIE_SHIFT         	(1U)
#define UJA113X_TIE_CFIE_F(x)          	((uint8_t)((uint8_t)(x) << UJA113X_TIE_CFIE_SHIFT) & \
										UJA113X_TIE_CFIE_MASK)

/*!
 * @brief Transceiver interrupt enable register, CAN wake-up interrupt
 * enable macros.
 */
#define UJA113X_TIE_CWIE_MASK          	(0x01U)
#define UJA113X_TIE_CWIE_SHIFT         	(0U)
#define UJA113X_TIE_CWIE_F(x)          	((uint8_t)((uint8_t)(x) << UJA113X_TIE_CWIE_SHIFT) & \
										UJA113X_TIE_CWIE_MASK)

/*!
 * @brief Transceiver interrupt enable register macros.
 */
#define UJA113X_TIE_MASK              (UJA113X_TIE_CBSE_MASK | UJA113X_TIE_CFE_MASK \
                                         | UJA113X_TIE_CWE_MASK)
#define UJA113X_TIE_SHIFT             (0U)
#define UJA113X_TIE_F(x)              ((uint8_t)((uint8_t)(x)<<UJA113X_TIE_SHIFT)&UJA113X_TIE_MASK)

/*******************************************************************************
 * Data rate register (0x26)
 ******************************************************************************/
/*!
 * @brief Data rate register, CAN data rate selection macros.
 */
#define UJA113X_DR_CDR_MASK            	(0x07U)
#define UJA113X_DR_CDR_SHIFT           	(0U)
#define UJA113X_DR_CDR_F(x)            	((uint8_t)((uint8_t)(x) << UJA113X_DR_CDR_SHIFT) & \
										UJA113X_DR_CDR_MASK)

/*!
 * @brief Data rate register macros.
 */
#define UJA113X_DR_MASK                	(UJA113X_DR_CDR_MASK)
#define UJA113X_DR_SHIFT               	(0U)
#define UJA113X_DR_F(x)                	((uint8_t)((uint8_t)(x) << UJA113X_DR_SHIFT) & \
										UJA113X_DR_SHIFT)

/*******************************************************************************
 * ID7:ID0 register (0x27)
 ******************************************************************************/
/*!
 * @brief bits ID7 to ID00 of the extended frame format macros.
 */
#define UJA113X_IDENTIF_0700_MASK       (0xFFU)
#define UJA113X_IDENTIF_0700_SHIFT      (0U)
#define UJA113X_IDENTIF_0700_F(x)       ((uint8_t)((uint8_t)(x) << UJA113X_IDENTIF_0700_SHIFT) & \
										UJA113X_IDENTIF_0700_MASK)

/*******************************************************************************
 * ID15:ID8 register (0x28)
 ******************************************************************************/
/*!
 * @brief bits ID15 to ID8 of the extended frame format macros.
 */
#define UJA113X_IDENTIF_1508_MASK       (0xFFU)
#define UJA113X_IDENTIF_1508_SHIFT      (0U)
#define UJA113X_IDENTIF_1508_F(x)       ((uint8_t)((uint8_t)(x)<<UJA113X_IDENTIF_1508_SHIFT)&UJA113X_IDENTIF_1508_MASK)

/*******************************************************************************
 * ID23:ID16 register (0x29)
 ******************************************************************************/
/*!
 * @brief Bits ID23 to ID18 of the extended frame format macros.
 */
#define UJA113X_IDENTIF_2318_MASK       (0xFCU)
#define UJA113X_IDENTIF_2318_SHIFT      (2U)
#define UJA113X_IDENTIF_2318_F(x)       ((uint8_t)((uint8_t)(x) << UJA113X_IDENTIF_2318_SHIFT) & \
										UJA113X_IDENTIF_2318_MASK)

/*!
 * @brief Bits ID17 to ID16 of the extended frame format macros.
 */
#define UJA113X_IDENTIF_1716_MASK       (0x03U)
#define UJA113X_IDENTIF_1716_SHIFT      (0U)
#define UJA113X_IDENTIF_1716_F(x)       ((uint8_t)((uint8_t)(x) << UJA113X_IDENTIF_1716_SHIFT) & \
										UJA113X_IDENTIF_1716_MASK)

/*******************************************************************************
 * ID28:ID24 register (0x2A)
 ******************************************************************************/
/*!
 * @brief Bits ID28 to ID24 of the extended frame format macros.
 */
#define UJA113X_IDENTIF_2824_MASK       (0x1FU)
#define UJA113X_IDENTIF_2824_SHIFT      (0U)
#define UJA113X_IDENTIF_2824_F(x)       ((uint8_t)((uint8_t)(x) << UJA113X_IDENTIF_2824_SHIFT) & \
										UJA113X_IDENTIF_2824_MASK)

/*******************************************************************************
 * IDM7:IDM0 register (0x2B)
 ******************************************************************************/
/*!
 * @brief ID mask bits 7 to 0 of extended frame format.
 */
#define UJA113X_MASK_0700_MASK          (0xFFU)
#define UJA113X_MASK_0700_SHIFT         (0U)
#define UJA113X_MASK_0700_F(x)          ((uint8_t)((uint8_t)(x) << UJA113X_MASK_0700_SHIFT) & \
										UJA113X_MASK_0700_MASK)

/*******************************************************************************
 * IDM15:IDM8 register (0x2C)
 ******************************************************************************/
/*!
 * @brief ID mask bits 15 to 8 of extended frame format.
 */
#define UJA113X_MASK_1508_MASK          (0xFFU)
#define UJA113X_MASK_1508_SHIFT         (0U)
#define UJA113X_MASK_1508_F(x)          ((uint8_t)((uint8_t)(x) << UJA113X_MASK_1508_SHIFT) & \
										UJA113X_MASK_1508_MASK)

