OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_uja113x/include/sbc_uja113x_map.h
/*******************************************************************************
 * IDM23:IDM16 register (0x2D)
 ******************************************************************************/
/*!
 * @brief ID mask bits 23 to 18 of extended frame format.
 */
#define UJA113X_MASK_2318_MASK          (0xFCU)
#define UJA113X_MASK_2318_SHIFT         (2U)
#define UJA113X_MASK_2318_F(x)          ((uint8_t)((uint8_t)(x) << UJA113X_MASK_2318_SHIFT) & \
										UJA113X_MASK_2318_MASK)

/*!
 * @brief ID mask bits 17 to 16 of extended frame format.
 */
#define UJA113X_MASK_1716_MASK          (0x03U)
#define UJA113X_MASK_1716_SHIFT         (2U)
#define UJA113X_MASK_1716_F(x)          ((uint8_t)((uint8_t)(x) << UJA113X_MASK_1716_SHIFT) & \
										UJA113X_MASK_1716_MASK)

/*******************************************************************************
 * IDM28:IDM24 register (0x2E)
 ******************************************************************************/
/*!
 * @brief ID mask bits 28 to 24 of extended frame format.
 */
#define UJA113X_MASK_2824_MASK          (0x1FU)
#define UJA113X_MASK_2824_SHIFT         (0U)
#define UJA113X_MASK_2824_F(x)          ((uint8_t)((uint8_t)(x) << UJA113X_MASK_2824_SHIFT) & \
										UJA113X_MASK_2824_MASK)

/*******************************************************************************
 * Frame control register (0x2F)
 ******************************************************************************/
/*!
 * @brief Frame control register, identifier format macros.
 */
#define UJA113X_FC_IDE_MASK           	(0x80U)
#define UJA113X_FC_IDE_SHIFT          	(7U)
#define UJA113X_FC_IDE_F(x)           	((uint8_t)((uint8_t)(x) << UJA113X_FC_IDE_SHIFT) & \
										UJA113X_FC_IDE_MASK)

/*!
 * @brief Frame control register, partial networking data mask macros.
 */
#define UJA113X_FC_PNDM_MASK          	(0x40U)
#define UJA113X_FC_PNDM_SHIFT         	(6U)
#define UJA113X_FC_PNDM_F(x)          	((uint8_t)((uint8_t)(x) << UJA113X_FC_PNDM_SHIFT) & \
										UJA113X_FC_PNDM_MASK)

/*!
 * @brief Frame control register, number of data bytes expected in a CAN frame macros.
 */
#define UJA113X_FC_DLC_MASK           	(0x0FU)
#define UJA113X_FC_DLC_SHIFT          	(0U)
#define UJA113X_FC_DLC_F(x)           	((uint8_t)((uint8_t)(x) << UJA113X_FC_DLC_SHIFT) & \
										UJA113X_FC_DLC_MASK)

/*!
 * @brief  Frame control register macros.
 */
#define UJA113X_FC_MASK               	(UJA113X_FC_IDE_MASK | UJA113X_FC_PNDM_MASK | \
		                                UJA113X_FC_DLC_MASK)
#define UJA113X_FC_SHIFT              	(0U)
#define UJA113X_FC_F(x)               	((uint8_t)((uint8_t)(x) << UJA113X_FC_SHIFT) & \
										UJA113X_FC_MASK)

/*******************************************************************************
 * HVIO bank 0 and 1 control registers (0x30 - 0x4F)
 ******************************************************************************/

/*******************************************************************************
 * HVIOn control registers (0x30 - 0x33, 0x40 - 0x43)
 ******************************************************************************/
/*!
 * @brief HVIOn control register, HVIOn shutdown control macros.
 */
#define UJA113X_HVIONC_IONSC_MASK       (0xC0U)
#define UJA113X_HVIONC_IONSC_SHIFT      (6U)
#define UJA113X_HVIONC_IONSC_F(x)       ((uint8_t)((uint8_t)(x) << UJA113X_HVIONC_IONSC_SHIFT) & \
										UJA113X_HVIONC_IONSC_MASK)

/*!
 * @brief HVIOn control register, HVIOn activation control macros.
 */
#define UJA113X_HVIONC_IONAC_MASK       (0x38U)
#define UJA113X_HVIONC_IONAC_SHIFT      (3U)
#define UJA113X_HVIONC_IONAC_F(x)       ((uint8_t)((uint8_t)(x) << UJA113X_HVIONC_IONAC_SHIFT) & \
										UJA113X_HVIONC_IONAC_MASK)

/*!
 * @brief HVIOn control register, HVIOn configuration control macros.
 */
#define UJA113X_HVIONC_IONCC_MASK       (0x07U)
#define UJA113X_HVIONC_IONCC_SHIFT      (0U)
#define UJA113X_HVIONC_IONCC_F(x)       ((uint8_t)((uint8_t)(x) << UJA113X_HVIONC_IONCC_SHIFT) & \
										UJA113X_HVIONC_IONCC_MASK)

/*!
 * @brief HVIOn control register.
 */
#define UJA113X_HVIONC_MASK             (UJA113X_HVIONC_IONSC_MASK | UJA113X_HVIONC_IONAC_MASK | \
		                                UJA113X_HVIONC_IONCC_MASK)
#define UJA113X_HVIONC_SHIFT            (0U)
#define UJA113X_HVIONC_F(x)             ((uint8_t)((uint8_t)(x) << UJA113X_HVIONC_SHIFT) & \
										UJA113X_HVIONC_MASK)

/*******************************************************************************
 * Bank 0 (HVIO1 to HVIO4) and 1 (HVIO5 to HVIO8) wake-up threshold control
 * register (0x34, 0x44)
 ******************************************************************************/
/*!
 * @brief Bank 0 and 1 wake-up threshold control register, wake-up threshold
 * configuration macros.
 */
#define UJA113X_BNWTC_BNWTC_MASK       	(0x01U)
#define UJA113X_BNWTC_BNWTC_SHIFT      	(0U)
#define UJA113X_BNWTC_BNWTC_F(x)       	((uint8_t)((uint8_t)(x) << UJA113X_BNWTC_BNWTC_MASK) & \
										UJA113X_BNWTC_BNWTC_SHIFT)

/*!
 * @brief Bank 0 and 1 wake-up threshold control register macros.
 */
#define UJA113X_BNWTC_MASK             	(UJA113X_BNWTC_BNWTC_MASK)
#define UJA113X_BNWTC_SHIFT            	(0U)
#define UJA113X_BNWTC_F(x)             	((uint8_t)((uint8_t)(x) << UJA113X_BNWTC_SHIFT) & \
										UJA113X_BNWTC_MASK)

/*******************************************************************************
 * Bank 0 (HVIO1 to HVIO4) and 1 (HVIO5 to HVIO8) wake-up status register
 * (0x35, 0x45)
 ******************************************************************************/
/*!
 * @brief Bank 0 and 1 wake-up status register, status of input voltage on
 * HVIO4/HVIO8 macros.
 */
#define UJA113X_BNWS_IO48WLS_MASK       (0x08U)
#define UJA113X_BNWS_IO48WLS_SHIFT      (3U)
#define UJA113X_BNWS_IO48WLS_F(x)       ((uint8_t)((uint8_t)(x) << UJA113X_BNWS_IO48WLS_MASK) & \
										UJA113X_BNWS_IO48WLS_SHIFT)

/*!
 * @brief Bank 0 and 1 wake-up status register, status of input voltage on
 * HVIO3/HVIO7 macros.
 */
#define UJA113X_BNWS_IO37WLS_MASK       (0x04U)
#define UJA113X_BNWS_IO37WLS_SHIFT      (2U)
#define UJA113X_BNWS_IO37WLS_F(x)       ((uint8_t)((uint8_t)(x) << UJA113X_BNWS_IO37WLS_MASK) & \
										UJA113X_BNWS_IO37WLS_SHIFT)

/*!
 * @brief Bank 0 and 1 wake-up status register, status of input voltage on
 * HVIO2/HVIO6 macros.
 */
#define UJA113X_BNWS_IO26WLS_MASK       (0x02U)
#define UJA113X_BNWS_IO26WLS_SHIFT      (1U)
#define UJA113X_BNWS_IO26WLS_F(x)       ((uint8_t)((uint8_t)(x) << UJA113X_BNWS_IO26WLS_MASK) & \
										UJA113X_BNWS_IO26WLS_SHIFT)

/*!
 * @brief Bank 0 and 1 wake-up status register, status of input voltage on
 * HVIO1/HVIO5 macros.
 */
#define UJA113X_BNWS_IO15WLS_MASK       (0x01U)
#define UJA113X_BNWS_IO15WLS_SHIFT      (0U)
#define UJA113X_BNWS_IO15WLS_F(x)       ((uint8_t)((uint8_t)(x) << UJA113X_BNWS_IO15WLS_MASK) & \
										UJA113X_BNWS_IO15WLS_SHIFT)

/*!
 * @brief Bank 0 and 1 wake-up status register macros.
 */
#define UJA113X_BNWS_MASK             	(UJA113X_BNWS_IO48WLS_MASK | UJA113X_BNWS_IO37WLS_MASK | \
										UJA113X_BNWS_IO26WLS_MASK | UJA113X_BNWS_IO15WLS_MASK)
#define UJA113X_BNWS_SHIFT            	(0U)
#define UJA113X_BNWS_F(x)             	((uint8_t)((uint8_t)(x) << UJA113X_BNWS_SHIFT) & \
										UJA113X_BNWS_MASK)

