OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_uja113x/include/sbc_uja113x_map.h
/*******************************************************************************
 * Bank 0 (HVIO1 to HVIO4) and 1 (HVIO5 to HVIO8) driver status register
 * (0x36, 0x46)
 ******************************************************************************/
/*!
 * @brief Bank 0 and 1 driver status register, HVIO4/HVIO8 driver status macros.
 */
#define UJA113X_BNDS_IO48DS_MASK       	(0xC0U)
#define UJA113X_BNDS_IO48DS_SHIFT      	(6U)
#define UJA113X_BNDS_IO48DS_F(x)       	((uint8_t)((uint8_t)(x) << UJA113X_BNDS_IO48DS_MASK) & \
										UJA113X_BNDS_IO48DS_SHIFT)

/*!
 * @brief Bank 0 and 1 driver status register, HVIO3/HVIO7 driver status macros.
 */
#define UJA113X_BNDS_IO37DS_MASK       	(0x30U)
#define UJA113X_BNDS_IO37DS_SHIFT      	(4U)
#define UJA113X_BNDS_IO37DS_F(x)       	((uint8_t)((uint8_t)(x) << UJA113X_BNDS_IO37DS_MASK) & \
										UJA113X_BNDS_IO37DS_SHIFT)

/*!
 * @brief Bank 0 and 1 driver status register, HVIO2/HVIO6 driver status macros.
 */
#define UJA113X_BNDS_IO26DS_MASK       	(0x0CU)
#define UJA113X_BNDS_IO26DS_SHIFT      	(2U)
#define UJA113X_BNDS_IO26DS_F(x)       	((uint8_t)((uint8_t)(x) << UJA113X_BNDS_IO26DS_MASK) & \
										UJA113X_BNDS_IO26DS_SHIFT)

/*!
 * @brief Bank 0 and 1 driver status register, HVIO1/HVIO5 driver status macros.
 */
#define UJA113X_BNDS_IO15DS_MASK       	(0x03U)
#define UJA113X_BNDS_IO15DS_SHIFT      	(0U)
#define UJA113X_BNDS_IO15DS_F(x)       	((uint8_t)((uint8_t)(x) << UJA113X_BNDS_IO15DS_MASK) & \
										UJA113X_BNDS_IO15DS_SHIFT)

/*!
 * @brief Bank 0 and 1 driver status register macros.
 */
#define UJA113X_BNDS_MASK             	(UJA113X_BNDS_IO48DS_MASK | UJA113X_BNDS_IO37DS_MASK | \
										UJA113X_BNDS_IO26DS_MASK | UJA113X_BNDS_IO15DS_MASK)
#define UJA113X_BNDS_SHIFT            	(0U)
#define UJA113X_BNDS_F(x)             	((uint8_t)((uint8_t)(x) << UJA113X_BNDS_SHIFT) & \
										UJA113X_BNDS_MASK)


/*******************************************************************************
 * Bank 0 (HVIO1 to HVIO4) and 1 (HVIO5 to HVIO8) wake-up interrupt enable
 * register (0x37, 0x47)
 ******************************************************************************/
/*!
 * @brief Bank 0 and 1 wake-up interrupt enable register,
 * HVIO4/HVIO8 falling edge interrupt enable macros.
 */
#define UJA113X_BNWIE_IO48FEIE_MASK    	(0x80U)
#define UJA113X_BNWIE_IO48FEIE_SHIFT   	(7U)
#define UJA113X_BNWIE_IO48FEIE_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNWIE_IO48FEIE_SHIFT) & \
										UJA113X_BNWIE_IO48FEIE_MASK)

/*!
 * @brief Bank 0 and 1 wake-up interrupt enable register,
 * HVIO4/HVIO8 rising edge interrupt enable macros.
 */
#define UJA113X_BNWIE_IO48REIE_MASK    	(0x40U)
#define UJA113X_BNWIE_IO48REIE_SHIFT   	(6U)
#define UJA113X_BNWIE_IO48REIE_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNWIE_IO48REIE_SHIFT) & \
										UJA113X_BNWIE_IO48REIE_MASK)

/*!
 * @brief Bank 0 and 1 wake-up interrupt enable register,
 * HVIO3/HVIO7 falling edge interrupt enable macros.
 */
#define UJA113X_BNWIE_IO37FEIE_MASK    	(0x20U)
#define UJA113X_BNWIE_IO37FEIE_SHIFT   	(5U)
#define UJA113X_BNWIE_IO37FEIE_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNWIE_IO37FEIE_SHIFT) & \
										UJA113X_BNWIE_IO37FEIE_MASK)

/*!
 * @brief Bank 0 and 1 wake-up interrupt enable register,
 * HVIO3/HVIO7 rising edge interrupt enable macros.
 */
#define UJA113X_BNWIE_IO37REIE_MASK    	(0x10U)
#define UJA113X_BNWIE_IO37REIE_SHIFT   	(4U)
#define UJA113X_BNWIE_IO37REIE_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNWIE_IO37REIE_SHIFT) & \
										UJA113X_BNWIE_IO37REIE_MASK)

/*!
 * @brief Bank 0 and 1 wake-up interrupt enable register,
 * HVIO2/HVIO6 falling edge interrupt enable macros.
 */
#define UJA113X_BNWIE_IO26FEIE_MASK    	(0x08U)
#define UJA113X_BNWIE_IO26FEIE_SHIFT   	(3U)
#define UJA113X_BNWIE_IO26FEIE_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNWIE_IO26FEIE_SHIFT) & \
										UJA113X_BNWIE_IO26FEIE_MASK)

/*!
 * @brief Bank 0 and 1 wake-up interrupt enable register,
 * HVIO2/HVIO6 rising edge interrupt enable macros.
 */
#define UJA113X_BNWIE_IO26REIE_MASK    	(0x04U)
#define UJA113X_BNWIE_IO26REIE_SHIFT   	(2U)
#define UJA113X_BNWIE_IO26REIE_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNWIE_IO26REIE_SHIFT) & \
										UJA113X_BNWIE_IO26REIE_MASK)

/*!
 * @brief Bank 0 and 1 wake-up interrupt enable register,
 * HVIO1/HVIO5 falling edge interrupt enable macros.
 */
#define UJA113X_BNWIE_IO15FEIE_MASK    	(0x02U)
#define UJA113X_BNWIE_IO15FEIE_SHIFT   	(1U)
#define UJA113X_BNWIE_IO15FEIE_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNWIE_IO15FEIE_SHIFT) & \
										UJA113X_BNWIE_IO15FEIE_MASK)

/*!
 * @brief Bank 0 and 1 wake-up interrupt enable register,
 * HVIO1/HVIO5 rising edge interrupt enable macros.
 */
#define UJA113X_BNWIE_IO15REIE_MASK    	(0x01U)
#define UJA113X_BNWIE_IO15REIE_SHIFT   	(0U)
#define UJA113X_BNWIE_IO15REIE_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNWIE_IO15REIE_SHIFT) & \
										UJA113X_BNWIE_IO15REIE_MASK)

/*!
 * @brief Bank 0 and 1 wake-up interrupt enable register macros.
 */
#define UJA113X_BNWIE_MASK             	(UJA113X_BNWIE_IO48FEIE_MASK | UJA113X_BNWIE_IO48REIE_MASK | \
										UJA113X_BNWIE_IO37FEIE_MASK | UJA113X_BNWIE_IO37REIE_MASK | \
										UJA113X_BNWIE_IO26FEIE_MASK | UJA113X_BNWIE_IO26REIE_MASK | \
										UJA113X_BNWIE_IO15FEIE_MASK | UJA113X_BNWIE_IO15REIE_MASK)
#define UJA113X_BNWIE_SHIFT            	(0U)
#define UJA113X_BNWIE_F(x)             	((uint8_t)((uint8_t)(x) << UJA113X_BNWIE_SHIFT) & \
										UJA113X_BNWIE_MASK)

/*******************************************************************************
 * Bank 0 (HVIO1 to HVIO4) and 1 (HVIO5 to HVIO8) fail interrupt enable
 * register (0x38, 0x48)
 ******************************************************************************/
/*!
 * @brief Bank 0 and 1 fail interrupt enable register,
 * HVIO4/HVIO8 short circuit interrupt enable macros.
 */
#define UJA113X_BNFIE_IO48SCIE_MASK    	(0x80U)
#define UJA113X_BNFIE_IO48SCIE_SHIFT   	(7U)
#define UJA113X_BNFIE_IO48SCIE_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNFIE_IO48SCIE_SHIFT) & \
										UJA113X_BNFIE_IO48SCIE_MASK)

/*!
 * @brief Bank 0 and 1 fail interrupt enable register,
 * HVIO4/HVIO8 open load interrupt enable macros.
 */
#define UJA113X_BNFIE_IO48OLIE_MASK    	(0x40U)
#define UJA113X_BNFIE_IO48OLIE_SHIFT   	(6U)
#define UJA113X_BNFIE_IO48OLIE_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNFIE_IO48OLIE_SHIFT) & \
										UJA113X_BNFIE_IO48OLIE_MASK)

/*!
 * @brief Bank 0 and 1 fail interrupt enable register,
 * HVIO3/HVIO7 short circuit interrupt enable macros.
 */
#define UJA113X_BNFIE_IO37SCIE_MASK    	(0x20U)
#define UJA113X_BNFIE_IO37SCIE_SHIFT   	(5U)
#define UJA113X_BNFIE_IO37SCIE_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNFIE_IO37SCIE_SHIFT) & \
										UJA113X_BNFIE_IO37SCIE_MASK)

/*!
 * @brief Bank 0 and 1 fail interrupt enable register,
 * HVIO3/HVIO7 open load interrupt enable macros.
 */
#define UJA113X_BNFIE_IO37OLIE_MASK    	(0x10U)
#define UJA113X_BNFIE_IO37OLIE_SHIFT   	(4U)
#define UJA113X_BNFIE_IO37OLIE_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNFIE_IO37OLIE_SHIFT) & \
										UJA113X_BNFIE_IO37OLIE_MASK)

/*!
 * @brief Bank 0 and 1 fail interrupt enable register,
 * HVIO2/HVIO6 short circuit interrupt enable macros.
 */
#define UJA113X_BNFIE_IO26SCIE_MASK    	(0x08U)
#define UJA113X_BNFIE_IO26SCIE_SHIFT   	(3U)
#define UJA113X_BNFIE_IO26SCIE_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNFIE_IO26SCIE_SHIFT) & \
										UJA113X_BNFIE_IO26SCIE_MASK)

/*!
 * @brief Bank 0 and 1 fail interrupt enable register,
 * HVIO2/HVIO6 open load interrupt enable macros.
 */
#define UJA113X_BNFIE_IO26OLIE_MASK    	(0x04U)
#define UJA113X_BNFIE_IO26OLIE_SHIFT   	(2U)
#define UJA113X_BNFIE_IO26OLIE_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNFIE_IO26OLIE_SHIFT) & \
										UJA113X_BNFIE_IO26OLIE_MASK)

/*!
 * @brief Bank 0 and 1 fail interrupt enable register,
 * HVIO1/HVIO5 short circuit interrupt enable macros.
 */
#define UJA113X_BNFIE_IO15SCIE_MASK    	(0x02U)
#define UJA113X_BNFIE_IO15SCIE_SHIFT   	(1U)
#define UJA113X_BNFIE_IO15SCIE_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNFIE_IO15SCIE_SHIFT) & \
										UJA113X_BNFIE_IO15SCIE_MASK)

/*!
 * @brief Bank 0 and 1 fail interrupt enable register,
 * HVIO1/HVIO5 open load interrupt enable macros.
 */
#define UJA113X_BNFIE_IO15OLIE_MASK    	(0x01U)
#define UJA113X_BNFIE_IO15OLIE_SHIFT   	(0U)
#define UJA113X_BNFIE_IO15OLIE_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNFIE_IO15OLIE_SHIFT) & \
										UJA113X_BNFIE_IO15OLIE_MASK)

/*!
 * @brief Bank 0 and 1 fail interrupt enable register macros.
 */
#define UJA113X_BNFIE_MASK             	(UJA113X_BNFIE_IO48SCIE_MASK | UJA113X_BNFIE_IO48OLIE_MASK | \
										UJA113X_BNFIE_IO37SCIE_MASK | UJA113X_BNFIE_IO37OLIE_MASK | \
										UJA113X_BNFIE_IO26SCIE_MASK | UJA113X_BNFIE_IO26OLIE_MASK | \
										UJA113X_BNFIE_IO15SCIE_MASK | UJA113X_BNFIE_IO15OLIE_MASK)
#define UJA113X_BNFIE_SHIFT            	(0U)
#define UJA113X_BNFIE_F(x)             	((uint8_t)((uint8_t)(x) << UJA113X_BNFIE_SHIFT) & \
										UJA113X_BNFIE_MASK)

