OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_uja113x/include/sbc_uja113x_map.h
/*******************************************************************************
 * Bank 0 (HVIO1 to HVIO4) and 1 (HVIO5 to HVIO8) short-circuit detection
 * threshold control register (0x39, 0x49)
 ******************************************************************************/
/*!
 * @brief Bank 0 and 1 driver short-circuit detection threshold control register,
 * HVIO4/HVIO8 short-circuit detection threshold macros.
 */
#define UJA113X_BNSCTC_IO48SCTC_MASK    (0xC0U)
#define UJA113X_BNSCTC_IO48SCTC_SHIFT   (6U)
#define UJA113X_BNSCTC_IO48SCTC_F(x)    ((uint8_t)((uint8_t)(x) << UJA113X_BNSCTC_IO48SCTC_SHIFT) & \
										UJA113X_BNSCTC_IO48SCTC_MASK)

/*!
 * @brief Bank 0 and 1 driver short-circuit detection threshold control register,
 * HVIO3/HVIO7 short-circuit detection threshold macros.
 */
#define UJA113X_BNSCTC_IO37SCTC_MASK    (0x30U)
#define UJA113X_BNSCTC_IO37SCTC_SHIFT   (4U)
#define UJA113X_BNSCTC_IO37SCTC_F(x)    ((uint8_t)((uint8_t)(x) << UJA113X_BNSCTC_IO37SCTC_SHIFT) & \
										UJA113X_BNSCTC_IO37SCTC_MASK)

/*!
 * @brief Bank 0 and 1 driver short-circuit detection threshold control register,
 * HVIO2/HVIO6 short-circuit detection threshold macros.
 */
#define UJA113X_BNSCTC_IO26SCTC_MASK    (0x0CU)
#define UJA113X_BNSCTC_IO26SCTC_SHIFT   (2U)
#define UJA113X_BNSCTC_IO26SCTC_F(x)    ((uint8_t)((uint8_t)(x) << UJA113X_BNSCTC_IO26SCTC_SHIFT) & \
										UJA113X_BNSCTC_IO26SCTC_MASK)

/*!
 * @brief Bank 0 and 1 driver short-circuit detection threshold control register,
 * HVIO1/HVIO5 short-circuit detection threshold macros.
 */
#define UJA113X_BNSCTC_IO15SCTC_MASK    (0x03U)
#define UJA113X_BNSCTC_IO15SCTC_SHIFT   (0U)
#define UJA113X_BNSCTC_IO15SCTC_F(x)    ((uint8_t)((uint8_t)(x) << UJA113X_BNSCTC_IO15SCTC_SHIFT) & \
										UJA113X_BNSCTC_IO15SCTC_MASK)

/*!
 * @brief Bank 0 and 1 driver short-circuit detection threshold control register
 * macros.
 */
#define UJA113X_BNSCTC_MASK             (UJA113X_BNSCTC_IO48SCTC_MASK | UJA113X_BNSCTC_IO37SCTC_MASK | \
										UJA113X_BNSCTC_IO26SCTC_MASK | UJA113X_BNSCTC_IO15SCTC_MASK)
#define UJA113X_BNSCTC_SHIFT            (0U)
#define UJA113X_BNSCTC_F(x)             ((uint8_t)((uint8_t)(x) << UJA113X_BNSCTC_SHIFT) & \
										UJA113X_BNSCTC_MASK)

/*******************************************************************************
 * Bank 0 (HVIO1 to HVIO4) and 1 (HVIO5 to HVIO8) open-load detection
 * threshold control register (0x3A, 0x4A)
 ******************************************************************************/
/*!
 * @brief Bank 0 and 1 driver open-load detection threshold control register,
 * HVIO4/HVIO8 open-load detection threshold macros.
 */
#define UJA113X_BNOLTC_IO48OLTC_MASK    (0xC0U)
#define UJA113X_BNOLTC_IO48OLTC_SHIFT   (6U)
#define UJA113X_BNOLTC_IO48OLTC_F(x)    ((uint8_t)((uint8_t)(x) << UJA113X_BNOLTC_IO48OLTC_SHIFT) & \
										UJA113X_BNOLTC_IO48OLTC_MASK)

/*!
 * @brief Bank 0 and 1 driver open-load detection threshold control register,
 * HVIO3/HVIO7 open-load detection threshold macros.
 */
#define UJA113X_BNOLTC_IO37OLTC_MASK    (0x30U)
#define UJA113X_BNOLTC_IO37OLTC_SHIFT   (4U)
#define UJA113X_BNOLTC_IO37OLTC_F(x)    ((uint8_t)((uint8_t)(x) << UJA113X_BNOLTC_IO37OLTC_SHIFT) & \
										UJA113X_BNOLTC_IO37OLTC_MASK)

/*!
 * @brief Bank 0 and 1 driver open-load detection threshold control register,
 * HVIO2/HVIO6 open-load detection threshold macros.
 */
#define UJA113X_BNOLTC_IO26OLTC_MASK    (0x0CU)
#define UJA113X_BNOLTC_IO26OLTC_SHIFT   (2U)
#define UJA113X_BNOLTC_IO26OLTC_F(x)    ((uint8_t)((uint8_t)(x) << UJA113X_BNOLTC_IO26OLTC_SHIFT) & \
										UJA113X_BNOLTC_IO26OLTC_MASK)

/*!
 * @brief Bank 0 and 1 driver open-load detection threshold control register,
 * HVIO1/HVIO5 open-load detection threshold macros.
 */
#define UJA113X_BNOLTC_IO15OLTC_MASK    (0x03U)
#define UJA113X_BNOLTC_IO15OLTC_SHIFT   (0U)
#define UJA113X_BNOLTC_IO15OLTC_F(x)    ((uint8_t)((uint8_t)(x) << UJA113X_BNOLTC_IO15OLTC_SHIFT) & \
										UJA113X_BNOLTC_IO15OLTC_MASK)

/*!
 * @brief Bank 0 and 1 driver open-load detection threshold control register
 * macros.
 */
#define UJA113X_BNOLTC_MASK             (UJA113X_BNOLTC_IO48OLTC_MASK | UJA113X_BNOLTC_IO37OLTC_MASK | \
										UJA113X_BNOLTC_IO26OLTC_MASK | UJA113X_BNOLTC_IO15OLTC_MASK)
#define UJA113X_BNOLTC_SHIFT            (0U)
#define UJA113X_BNOLTC_F(x)             ((uint8_t)((uint8_t)(x) << UJA113X_BNOLTC_SHIFT) & \
										UJA113X_BNOLTC_MASK)

/*******************************************************************************
 * Timer control registers (0x50 - 0x5F)
 ******************************************************************************/
/*******************************************************************************
 * Timer 1, 2, 3 and 4 control registers (0x50, 0x52, 0x54, 0x56)
 ******************************************************************************/
/*!
 * @brief Timer 1, 2, 3 and 4 control registers, timer 1, 2, 3 and 4 period macros.
 */
#define UJA113X_TNC_TNPC_MASK     		(0x3CU)
#define UJA113X_TNC_TNPC_SHIFT    		(2U)
#define UJA113X_TNC_TNPC_F(x)     		((uint8_t)((uint8_t)(x) << UJA113X_TNC_TNPC_SHIFT) & \
										UJA113X_TNC_TNPC_MASK)

/*!
 * @brief Timer 1 control registers, timer 1 mode macros.
 */
#define UJA113X_T1C_TNMC_MASK     		(0x01U)
#define UJA113X_T1C_TNMC_SHIFT    		(0U)
#define UJA113X_T1C_TNMC_F(x)     		((uint8_t)((uint8_t)(x) << UJA113X_T1C_TNMC_SHIFT) & \
										UJA113X_T1C_TNMC_MASK)

/*!
 * @brief Timer 1 control registers macros.
 */
#define UJA113X_T1C_MASK             	(UJA113X_TNC_TNPC_MASK | UJA113X_T1C_TNMC_MASK)
#define UJA113X_T1C_SHIFT            	(0U)
#define UJA113X_T1C_F(x)             	((uint8_t)((uint8_t)(x) << UJA113X_T1C_SHIFT) & \
										UJA113X_T1C_MASK)

/*!
 * @brief Timer 2, 3 and 4 control registers, timer 2, 3 and 4 mode macros.
 */
#define UJA113X_TNC_TNMC_MASK         (0x03U)
#define UJA113X_TNC_TNMC_SHIFT        (0U)
#define UJA113X_TNC_TNMC_F(x)         ((uint8_t)((uint8_t)(x) << UJA113X_TNC_TNMC_SHIFT) & \
                    UJA113X_TNC_TNMC_MASK)

/*!
 * @brief Timer 2, 3 and 4 control registers macros.
 */
#define UJA113X_TNC_MASK              (UJA113X_TNC_TNPC_MASK | UJA113X_TNC_TNMC_MASK)
#define UJA113X_TNC_SHIFT             (0U)
#define UJA113X_TNC_F(x)              ((uint8_t)((uint8_t)(x) << UJA113X_TNC_SHIFT) & \
                    UJA113X_TNC_MASK)

