OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_uja113x/include/sbc_uja113x_map.h
/*******************************************************************************
 * Timer 1, 2, 3 and 4 duty cycle control registers (0x51, 0x53, 0x55, 0x57)
 ******************************************************************************/
/*!
 * @brief Timer 1, 2, 3 and 4 duty cycle control registers, timer 1, 2, 3
 * and 4 period macros.
 */
#define UJA113X_TNDCC_TNDCC_MASK    	(0xFFU)
#define UJA113X_TNDCC_TNDCC_SHIFT    	(0U)
#define UJA113X_TNDCC_TNDCC_F(x)     	((uint8_t)((uint8_t)(x) << UJA113X_TNDCC_TNDCC_SHIFT) & \
										UJA113X_TNDCC_TNDCC_MASK)

/*!
 * @brief Timer 1, 2, 3 and 4 duty cycle control registers macros.
 */
#define UJA113X_TNDCC_MASK             	(UJA113X_TNDCC_TNDCC_MASK)
#define UJA113X_TNDCC_SHIFT            	(0U)
#define UJA113X_TNDCC_F(x)             	((uint8_t)((uint8_t)(x) << UJA113X_TNDCC_SHIFT) & \
										UJA113X_TNDCC_MASK)

/*******************************************************************************
 * Interrupt status registers (0x60 - 0x6F)
 ******************************************************************************/

/*******************************************************************************
 * Global interrupt status register (0x60)
 ******************************************************************************/
/*!
 * @brief Global interrupt status register, an interrupt in the bank 1 fail
 * interrupt status register macros.
 */
#define UJA113X_GIS_B1FIS_MASK        	(0x40U)
#define UJA113X_GIS_B1FIS_SHIFT       	(6U)
#define UJA113X_GIS_B1FIS_F(x)        	((uint8_t)((uint8_t)(x) << UJA113X_GIS_B1FIS_SHIFT) & \
										UJA113X_GIS_B1FIS_MASK)

/*!
 * @brief Global interrupt status register, an interrupt in the bank 1 wake-up
 * interrupt status register macros.
 */
#define UJA113X_GIS_B1WIS_MASK        	(0x20U)
#define UJA113X_GIS_B1WIS_SHIFT       	(5U)
#define UJA113X_GIS_B1WIS_F(x)        	((uint8_t)((uint8_t)(x) << UJA113X_GIS_B1WIS_SHIFT) & \
										UJA113X_GIS_B1WIS_MASK)

/*!
 * @brief Global interrupt status register, an interrupt in the bank 0 fail
 * interrupt status register macros.
 */
#define UJA113X_GIS_B0FIS_MASK        	(0x10U)
#define UJA113X_GIS_B0FIS_SHIFT       	(4U)
#define UJA113X_GIS_B0FIS_F(x)        	((uint8_t)((uint8_t)(x) << UJA113X_GIS_B0FIS_SHIFT) & \
										UJA113X_GIS_B0FIS_MASK)

/*!
 * @brief Global interrupt status register, an interrupt in the bank 0 wake-up
 * interrupt status register macros.
 */
#define UJA113X_GIS_B0WIS_MASK        	(0x08U)
#define UJA113X_GIS_B0WIS_SHIFT       	(3U)
#define UJA113X_GIS_B0WIS_F(x)        	((uint8_t)((uint8_t)(x) << UJA113X_GIS_B0WIS_SHIFT) & \
										UJA113X_GIS_B0WIS_MASK)

/*!
 * @brief Global interrupt status register, an interrupt in the Transceiver
 * interrupt status register macros.
 */
#define UJA113X_GIS_TRXIS_MASK       	(0x04U)
#define UJA113X_GIS_TRXIS_SHIFT      	(2U)
#define UJA113X_GIS_TRXIS_F(x)       	((uint8_t)((uint8_t)(x) << UJA113X_GIS_TRXIS_SHIFT) & \
										UJA113X_GIS_TRXIS_MASK)

/*!
 * @brief Global interrupt status register, an interrupt in the Supply interrupt
 * status register macros.
 */
#define UJA113X_GIS_SUPIS_MASK       	(0x02U)
#define UJA113X_GIS_SUPIS_SHIFT      	(1U)
#define UJA113X_GIS_SUPIS_F(x)       	((uint8_t)((uint8_t)(x) << UJA113X_GIS_SUPIS_SHIFT) & \
										UJA113X_GIS_SUPIS_MASK)

/*!
 * @brief Global interrupt status register, an interrupt in the System interrupt
 * status register macros.
 */
#define UJA113X_GIS_SYSIS_MASK       	(0x01U)
#define UJA113X_GIS_SYSIS_SHIFT      	(0U)
#define UJA113X_GIS_SYSIS_F(x)       	((uint8_t)((uint8_t)(x) << UJA113X_GIS_SYSIS_SHIFT) & \
										UJA113X_GIS_SYSIS_MASK)

/*!
 * @brief Global interrupt status register macros.
 */
#define UJA113X_GIS_MASK            	(UJA113X_GIS_B1FIS_MASK | UJA113X_GIS_B1WIS_MASK \
		                                UJA113X_GIS_B0FIS_MASK | UJA113X_GIS_B0WIS_MASK | \
										UJA113X_GIS_TRXIS_MASK | UJA113X_GIS_SUPIS_MASK | \
										UJA113X_GIS_SYSIS_MASK)
#define UJA113X_GIS_SHIFT           	(0U)
#define UJA113X_GIS_F(x)            	((uint8_t)((uint8_t)(x) << UJA113X_GIS_SHIFT) & \
										UJA113X_GIS_MASK)

/*******************************************************************************
 * System interrupt status register (0x61)
 ******************************************************************************/
/*!
 * @brief System interrupt status register, overvoltage shut-down interrupt status macros.
 */
#define UJA113X_SYSIS_OVSD_MASK        	(0x10U)
#define UJA113X_SYSIS_OVSD_SHIFT       	(4U)
#define UJA113X_SYSIS_OVSD_F(x)        	((uint8_t)((uint8_t)(x) << UJA113X_SYSIS_OVSD_SHIFT) & \
										UJA113X_SYSIS_OVSD_MASK)

/*!
 * @brief System interrupt status register, power-on status macros.
 */
#define UJA113X_SYSIS_POS_MASK        	(0x10U)
#define UJA113X_SYSIS_POS_SHIFT       	(4U)
#define UJA113X_SYSIS_POS_F(x)        	((uint8_t)((uint8_t)(x) << UJA113X_SYSIS_POS_SHIFT) & \
										UJA113X_SYSIS_POS_MASK)

/*!
 * @brief System interrupt status register, overtemperature warning interrupt status
 * macros.
 */
#define UJA113X_SYSIS_OTWI_MASK       	(0x04U)
#define UJA113X_SYSIS_OTWI_SHIFT      	(2U)
#define UJA113X_SYSIS_OTWI_F(x)       	((uint8_t)((uint8_t)(x) << UJA113X_SYSIS_OTWI_SHIFT) & \
										UJA113X_SYSIS_OTWI_MASK)

/*!
 * @brief System interrupt status register, SPI failure interrupt status macros.
 */
#define UJA113X_SYSIS_SPIFI_MASK      	(0x02U)
#define UJA113X_SYSIS_SPIFI_SHIFT     	(1U)
#define UJA113X_SYSIS_SPIFI_F(x)      	((uint8_t)((uint8_t)(x) << UJA113X_SYSIS_SPIFI_SHIFT) & \
										UJA113X_SYSIS_SPIF_MASK)

/*!
 * @brief System interrupt status register, watchdog failure interrupt status macros.
 */
#define UJA113X_SYSIS_WDI_MASK       	(0x01U)
#define UJA113X_SYSIS_WDI_SHIFT      	(0U)
#define UJA113X_SYSIS_WDI_F(x)       	((uint8_t)((uint8_t)(x) << UJA113X_SYSIS_WDI_SHIFT) & \
										UJA113X_SYSIS_WDI_MASK)

/*!
 * @brief System interrupt status register macros.
 */
#define UJA113X_SYSIS_MASK           	(UJA113X_SYSIS_OVSD_MASK | UJA113X_SYSIS_POS_MASK | \
		                           	   	UJA113X_SYSIS_OTWI_MASK | UJA113X_SYSIS_SPIFI_MASK | \
										UJA113X_SYSIS_WDI_MASK)
#define UJA113X_SYSIS_SHIFT          	(0U)
#define UJA113X_SYSIS_F(x)           	((uint8_t)((uint8_t)(x) << UJA113X_SYSIS_SHIFT) & \
										UJA113X_SYSIS_MASK)

