OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_uja113x/include/sbc_uja113x_map.h
/*******************************************************************************
 * Supply interrupt status register (0x62)
 ******************************************************************************/
/*!
 * @brief Supply interrupt status register, SMPS status interrupt macros.
 */
#define UJA113X_SUPIS_SMPSSI_MASK       (0x20U)
#define UJA113X_SUPIS_SMPSSI_SHIFT      (5U)
#define UJA113X_SUPIS_SMPSSI_F(x)       ((uint8_t)((uint8_t)(x) << UJA113X_SUPIS_SMPSSI_SHIFT) & \
										UJA113X_SUPIS_SMPSSI_MASK)

/*!
 * @brief Supply interrupt status register, battery monitor overvoltage interrupt
 * macros.
 */
#define UJA113X_SUPIS_BMOI_MASK       	(0x10U)
#define UJA113X_SUPIS_BMOI_SHIFT      	(4U)
#define UJA113X_SUPIS_BMOI_F(x)       	((uint8_t)((uint8_t)(x) << UJA113X_SUPIS_BMOI_SHIFT) & \
										UJA113X_SUPIS_BMOI_MASK)

/*!
 * @brief Supply interrupt status register, battery monitor undervoltage interrupt
 * macros.
 */
#define UJA113X_SUPIS_BMUI_MASK       	(0x08U)
#define UJA113X_SUPIS_BMUI_SHIFT      	(3U)
#define UJA113X_SUPIS_BMUI_F(x)       	((uint8_t)((uint8_t)(x) << UJA113X_SUPIS_BMUI_SHIFT) & \
										UJA113X_SUPIS_BMUI_MASK)

/*!
 * @brief Supply interrupt status register, VEXT overvoltage interrupt status
 * macros.
 */
#define UJA113X_SUPIS_VEXTOI_MASK       (0x04U)
#define UJA113X_SUPIS_VEXTOI_SHIFT      (2U)
#define UJA113X_SUPIS_VEXTOI_F(x)       ((uint8_t)((uint8_t)(x) << UJA113X_SUPIS_VEXTOI_SHIFT) & \
										UJA113X_SUPIS_VEXTOI_MASK)

/*!
 * @brief Supply interrupt status register, VEXT undervoltage interrupt status
 * macros.
 */
#define UJA113X_SUPIS_VEXTUI_MASK       (0x02U)
#define UJA113X_SUPIS_VEXTUI_SHIFT      (1U)
#define UJA113X_SUPIS_VEXTUI_F(x)       ((uint8_t)((uint8_t)(x) << UJA113X_SUPIS_VEXTUI_SHIFT) & \
										UJA113X_SUPIS_VEXTUI_MASK)

/*!
 * @brief  Supply interrupt status register, V1 undervoltage interrupt status
 * macros.
 */
#define UJA113X_SUPIS_V1UI_MASK       	(0x01U)
#define UJA113X_SUPIS_V1UI_SHIFT      	(0U)
#define UJA113X_SUPIS_V1UI_F(x)       	((uint8_t)((uint8_t)(x) << UJA113X_SUPIS_V1UI_SHIFT) & \
										UJA113X_SUPIS_V1UI_MASK)

/*!
 * @brief Transceiver interrupt status register macros.
 */
#define UJA113X_SUPIS_MASK           	(UJA113X_SUPIS_SMPSSI_MASK | UJA113X_SUPIS_BMOI_MASK | \
		                             	UJA113X_SUPIS_BMUI_MASK | UJA113X_SUPIS_VEXTOI_MASK | \
									 	UJA113X_SUPIS_VEXTUI_MASK | UJA113X_SUPIS_V1UI_MASK)
#define UJA113X_SUPIS_SHIFT          	(0U)
#define UJA113X_SUPIS_F(x)           	((uint8_t)((uint8_t)(x) << UJA113X_SUPIS_SHIFT) & \
										UJA113X_SUPIS_MASK)

/*******************************************************************************
 * Transceiver interrupt status register (0x63)
 ******************************************************************************/
/*!
 * @brief Transceiver interrupt status register, partial networking frame
 * detection error macros.
 */
#define UJA113X_TIS_PNFDEI_MASK   		(0x20U)
#define UJA113X_TIS_PNFDEI_SHIFT  		(5U)
#define UJA113X_TIS_PNFDEI_F(x)   		((uint8_t)((uint8_t)(x) << UJA113X_TIS_PNFDEI_SHIFT) & \
										UJA113X_TIS_PNFDEI_MASK)

/*!
 * @brief Transceiver interrupt status register, CAN-bus silence status macros.
 */
#define UJA113X_TIS_CBSI_MASK     		(0x10U)
#define UJA113X_TIS_CBSI_SHIFT    		(4U)
#define UJA113X_TIS_CBSI_F(x)     		((uint8_t)((uint8_t)(x) << UJA113X_TIS_CBSI_SHIFT) & \
										UJA113X_TIS_CBSI_MASK)

/*!
 * @brief Transceiver interrupt status register, LIN2 wake-up interrupt status
 * macros.
 */
#define UJA113X_TIS_LWI2_MASK     		(0x08U)
#define UJA113X_TIS_LWI2_SHIFT    		(3U)
#define UJA113X_TIS_LWI2_F(x)     		((uint8_t)((uint8_t)(x) << UJA113X_TIS_LWI2_SHIFT) & \
										UJA113X_TIS_LWI2_MASK)

/*!
 * @brief Transceiver interrupt status register, LIN1 wake-up interrupt status
 * macros.
 */
#define UJA113X_TIS_LWI1_MASK     		(0x04U)
#define UJA113X_TIS_LWI1_SHIFT    		(2U)
#define UJA113X_TIS_LWI1_F(x)     		((uint8_t)((uint8_t)(x) << UJA113X_TIS_LWI1_SHIFT) & \
										UJA113X_TIS_LWI1_MASK)

/*!
 * @brief Transceiver interrupt status register, CAN failure interrupt status
 * macros.
 */
#define UJA113X_TIS_CFI_MASK      		(0x02U)
#define UJA113X_TIS_CFI_SHIFT     		(1U)
#define UJA113X_TIS_CFI_F(x)      		((uint8_t)((uint8_t)(x) << UJA113X_TIS_CFI_SHIFT) & \
										UJA113X_TIS_CFI_MASK)

/*!
 * @brief Transceiver interrupt status register, CAN wake-up interrupt status
 * macros.
 */
#define UJA113X_TIS_CWI_MASK      		(0x01U)
#define UJA113X_TIS_CWI_SHIFT     		(0U)
#define UJA113X_TIS_CWI_F(x)      		((uint8_t)((uint8_t)(x) << UJA113X_TIS_CWI_SHIFT) & \
										UJA113X_TIS_CWI_MASK)

/*!
 * @brief Transceiver interrupt status register macros.
 */
#define UJA113X_TIS_MASK         		(UJA113X_TIS_PNFDEI_MASK | UJA113X_TIS_CBSI_MASK | \
		                         	 	UJA113X_TIS_LWI2_MASK | UJA113X_TIS_LWI1_MASK | \
										UJA113X_TIS_CFI_MASK | UJA113X_TIS_CWI_MASK)
#define UJA113X_TIS_SHIFT        		(0U)
#define UJA113X_TIS_F(x)         		((uint8_t)((uint8_t)(x) << UJA113X_TIS_SHIFT) & \
										UJA113X_TIS_MASK)

/*******************************************************************************
 * Bank 0 (HVIO1 to HVIO4) and 1 (HVIO5 to HVIO8) wake-up interrupt status
 * register (0x64, 0x66)
 ******************************************************************************/
/*!
 * @brief Bank 0 and 1 wake-up interrupt status register,
 * HVIO4/HVIO8 falling edge interrupt status macros.
 */
#define UJA113X_BNWIS_IO48FEI_MASK    	(0x80U)
#define UJA113X_BNWIS_IO48FEI_SHIFT   	(7U)
#define UJA113X_BNWIS_IO48FEI_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNWIS_IO48FEI_SHIFT) & \
										UJA113X_BNWIS_IO48FEI_MASK)

/*!
 * @brief Bank 0 and 1 wake-up interrupt status register,
 * HVIO4/HVIO8 rising edge interrupt status macros.
 */
#define UJA113X_BNWIS_IO48REI_MASK    	(0x40U)
#define UJA113X_BNWIS_IO48REI_SHIFT   	(6U)
#define UJA113X_BNWIS_IO48REI_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNWIS_IO48REI_SHIFT) & \
										UJA113X_BNWIS_IO48REI_MASK)

/*!
 * @brief Bank 0 and 1 wake-up interrupt status register,
 * HVIO3/HVIO7 falling edge interrupt status macros.
 */
#define UJA113X_BNWIS_IO37FEI_MASK    	(0x20U)
#define UJA113X_BNWIS_IO37FEI_SHIFT   	(5U)
#define UJA113X_BNWIS_IO37FEI_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNWIS_IO37FEI_SHIFT) & \
										UJA113X_BNWIS_IO37FEI_MASK)

/*!
 * @brief Bank 0 and 1 wake-up interrupt status register,
 * HVIO3/HVIO7 rising edge interrupt status macros.
 */
#define UJA113X_BNWIS_IO37REI_MASK    	(0x10U)
#define UJA113X_BNWIS_IO37REI_SHIFT   	(4U)
#define UJA113X_BNWIS_IO37REI_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNWIS_IO37REI_SHIFT) & \
										UJA113X_BNWIS_IO37REI_MASK)

/*!
 * @brief Bank 0 and 1 wake-up interrupt status register,
 * HVIO2/HVIO6 falling edge interrupt status macros.
 */
#define UJA113X_BNWIS_IO26FEI_MASK    	(0x08U)
#define UJA113X_BNWIS_IO26FEI_SHIFT   	(3U)
#define UJA113X_BNWIS_IO26FEI_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNWIS_IO26FEI_SHIFT) & \
										UJA113X_BNWIS_IO26FEI_MASK)

/*!
 * @brief Bank 0 and 1 wake-up interrupt status register,
 * HVIO2/HVIO6 rising edge interrupt status macros.
 */
#define UJA113X_BNWIS_IO26REI_MASK    	(0x04U)
#define UJA113X_BNWIS_IO26REI_SHIFT   	(2U)
#define UJA113X_BNWIS_IO26REI_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNWIS_IO26REI_SHIFT) & \
										UJA113X_BNWIS_IO26REI_MASK)

/*!
 * @brief Bank 0 and 1 wake-up interrupt status register,
 * HVIO1/HVIO5 falling edge interrupt status macros.
 */
#define UJA113X_BNWIS_IO15FEI_MASK    	(0x02U)
#define UJA113X_BNWIS_IO15FEI_SHIFT   	(1U)
#define UJA113X_BNWIS_IO15FEI_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNWIS_IO15FEI_SHIFT) & \
										UJA113X_BNWIS_IO15FEI_MASK)

/*!
 * @brief Bank 0 and 1 wake-up interrupt status register,
 * HVIO1/HVIO5 rising edge interrupt status macros.
 */
#define UJA113X_BNWIS_IO15REI_MASK    	(0x01U)
#define UJA113X_BNWIS_IO15REI_SHIFT   	(0U)
#define UJA113X_BNWIS_IO15REI_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNWIS_IO15REI_SHIFT) & \
										UJA113X_BNWIS_IO15REI_MASK)

/*!
 * @brief Bank 0 and 1 wake-up interrupt status register macros.
 */
#define UJA113X_BNWIS_MASK             	(UJA113X_BNWIS_IO48FEI_MASK | UJA113X_BNWIS_IO48REI_MASK | \
										UJA113X_BNWIS_IO37FEI_MASK | UJA113X_BNWIS_IO37REI_MASK | \
										UJA113X_BNWIS_IO26FEI_MASK | UJA113X_BNWIS_IO26REI_MASK | \
										UJA113X_BNWIS_IO15FEI_MASK | UJA113X_BNWIS_IO15REI_MASK)
#define UJA113X_BNWIS_SHIFT            	(0U)
#define UJA113X_BNWIS_F(x)             	((uint8_t)((uint8_t)(x) << UJA113X_BNWIS_SHIFT) & \
										UJA113X_BNWIS_MASK)

