OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_uja113x/include/sbc_uja113x_map.h
/*******************************************************************************
 * Bank 0 (HVIO1 to HVIO4) and 1 (HVIO5 to HVIO8) fail interrupt status
 * register (0x65, 0x67)
 ******************************************************************************/
/*!
 * @brief Bank 0 and 1 fail interrupt status register,
 * HVIO4/HVIO8 short circuit interrupt status macros.
 */
#define UJA113X_BNFIS_IO48SCI_MASK    	(0x80U)
#define UJA113X_BNFIS_IO48SCI_SHIFT   	(7U)
#define UJA113X_BNFIS_IO48SCI_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNFIS_IO48SCI_SHIFT) & \
										UJA113X_BNFIS_IO48SCI_MASK)

/*!
 * @brief Bank 0 and 1 fail interrupt status register,
 * HVIO4/HVIO8 open load interrupt status macros.
 */
#define UJA113X_BNFIS_IO48OLI_MASK    	(0x40U)
#define UJA113X_BNFIS_IO48OLI_SHIFT   	(6U)
#define UJA113X_BNFIS_IO48OLI_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNFIS_IO48OLI_SHIFT) & \
										UJA113X_BNFIS_IO48OLI_MASK)

/*!
 * @brief Bank 0 and 1 fail interrupt status register,
 * HVIO3/HVIO7 short circuit interrupt status macros.
 */
#define UJA113X_BNFIS_IO37SCI_MASK    	(0x20U)
#define UJA113X_BNFIS_IO37SCI_SHIFT   	(5U)
#define UJA113X_BNFIS_IO37SCI_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNFIS_IO37SCI_SHIFT) & \
										UJA113X_BNFIS_IO37SCI_MASK)

/*!
 * @brief Bank 0 and 1 fail interrupt status register,
 * HVIO3/HVIO7 open load interrupt status macros.
 */
#define UJA113X_BNFIS_IO37OLI_MASK    	(0x10U)
#define UJA113X_BNFIS_IO37OLI_SHIFT   	(4U)
#define UJA113X_BNFIS_IO37OLI_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNFIS_IO37OLI_SHIFT) & \
										UJA113X_BNFIS_IO37OLI_MASK)

/*!
 * @brief Bank 0 and 1 fail interrupt status register,
 * HVIO2/HVIO6 short circuit interrupt status macros.
 */
#define UJA113X_BNFIS_IO26SCI_MASK    	(0x08U)
#define UJA113X_BNFIS_IO26SCI_SHIFT   	(3U)
#define UJA113X_BNFIS_IO26SCI_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNFIS_IO26SCI_SHIFT) & \
										UJA113X_BNFIS_IO26SCI_MASK)

/*!
 * @brief Bank 0 and 1 fail interrupt status register,
 * HVIO2/HVIO6 open load interrupt status macros.
 */
#define UJA113X_BNFIS_IO26OLI_MASK    	(0x04U)
#define UJA113X_BNFIS_IO26OLI_SHIFT   	(2U)
#define UJA113X_BNFIS_IO26OLI_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNFIS_IO26OLI_SHIFT) & \
										UJA113X_BNFIS_IO26OLI_MASK)

/*!
 * @brief Bank 0 and 1 fail interrupt status register,
 * HVIO1/HVIO5 short circuit interrupt status macros.
 */
#define UJA113X_BNFIS_IO15SCI_MASK    	(0x02U)
#define UJA113X_BNFIS_IO15SCI_SHIFT   	(1U)
#define UJA113X_BNFIS_IO15SCI_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNFIS_IO15SCI_SHIFT) & \
										UJA113X_BNFIS_IO15SCI_MASK)

/*!
 * @brief Bank 0 and 1 fail interrupt status register,
 * HVIO1/HVIO5 open load interrupt status macros.
 */
#define UJA113X_BNFIS_IO15OLI_MASK    	(0x01U)
#define UJA113X_BNFIS_IO15OLI_SHIFT   	(0U)
#define UJA113X_BNFIS_IO15OLI_F(x)    	((uint8_t)((uint8_t)(x) << UJA113X_BNFIS_IO15OLI_SHIFT) & \
										UJA113X_BNFIS_IO15OLI_MASK)

/*!
 * @brief Bank 0 and 1 fail interrupt status register macros.
 */
#define UJA113X_BNFIS_MASK             	(UJA113X_BNFIS_IO48SCI_MASK | UJA113X_BNFIS_IO48OLI_MASK | \
										UJA113X_BNFIS_IO37SCI_MASK | UJA113X_BNFIS_IO37OLI_MASK | \
										UJA113X_BNFIS_IO26SCI_MASK | UJA113X_BNFIS_IO26OLI_MASK | \
										UJA113X_BNFIS_IO15SCI_MASK | UJA113X_BNFIS_IO15OLI_MASK)
#define UJA113X_BNFIS_SHIFT            	(0U)
#define UJA113X_BNFIS_F(x)             	((uint8_t)((uint8_t)(x) << UJA113X_BNFIS_SHIFT) & \
										UJA113X_BNFIS_MASK)




/*!
 * @brief  WAKE pin event status register, WAKE pin rising edge macros.
 */
#define UJA113X_WAKE_EVNT_STAT_WPR_MASK      (0x02U)
#define UJA113X_WAKE_EVNT_STAT_WPR_SHIFT     (1U)
#define UJA113X_WAKE_EVNT_STAT_WPR_F(x)      ((uint8_t)((uint8_t)(x)<<UJA113X_WAKE_EVNT_STAT_WPR_SHIFT)&UJA113X_WAKE_EVNT_STAT_WPR_MASK)

/*!
 * @brief  WAKE pin event status register, WAKE pin falling edge macros.
 */
#define UJA113X_WAKE_EVNT_STAT_WPF_MASK      (0x01U)
#define UJA113X_WAKE_EVNT_STAT_WPF_SHIFT     (0U)
#define UJA113X_WAKE_EVNT_STAT_WPF_F(x)      ((uint8_t)((uint8_t)(x)<<UJA113X_WAKE_EVNT_STAT_WPF_SHIFT)&UJA113X_WAKE_EVNT_STAT_WPF_MASK)

/*!
 * @brief  WAKE pin event status register macros.
 */
#define UJA113X_WAKE_EVNT_STAT_MASK          (UJA113X_WAKE_EVNT_STAT_WPR_MASK | UJA113X_WAKE_EVNT_STAT_WPF_MASK)
#define UJA113X_WAKE_EVNT_STAT_SHIFT         (0U)
#define UJA113X_WAKE_EVNT_STAT_F(x)          ((uint8_t)((uint8_t)(x)<<UJA113X_WAKE_EVNT_STAT_SHIFT)&UJA113X_WAKE_EVNT_STAT_MASK)

/*******************************************************************************
 * Data mask registers (0x68 to 0x6F)
 ******************************************************************************/
/*!
 * @brief Data mask registers, data mask 0-7 configuration macros.
 */
#define UJA113X_DMX_DM_MASK             (0xFFU)
#define UJA113X_DMX_DM_SHIFT            (0U)
#define UJA113X_DMX_DM_F(x)             ((uint8_t)((uint8_t)(x) << UJA113X_DMX_DM_SHIFT) & \
										UJA113X_DMX_DM_MASK)

/*******************************************************************************
 * MTPNV and ID registers (0x70 - 0x7F)
 ******************************************************************************/

/*******************************************************************************
 * MTPNV status register (0x70)
 ******************************************************************************/
/*!
 * @brief MTPNV status register, write counter macros.
 */
#define UJA113X_MTPNVS_WRCNTS_MASK      (0xFCU)
#define UJA113X_MTPNVS_WRCNTS_SHIFT     (2U)
#define UJA113X_MTPNVS_WRCNTS_F(x)      ((uint8_t)((uint8_t)(x) << UJA113X_MTPNVS_WRCNTS_SHIFT) & \
										UJA113X_MTPNVS_WRCNTS_MASK)

/*!
 * @brief MTPNV status register, error detection during MTPVN cell programming
 * macros.
 */
#define UJA113X_MTPNVS_ECCS_MASK        (0x02U)
#define UJA113X_MTPNVS_ECCS_SHIFT       (1U)
#define UJA113X_MTPNVS_ECCS_F(x)        ((uint8_t)((uint8_t)(x) << UJA113X_MTPNVS_ECCS_SHIFT) & \
										UJA113X_MTPNVS_ECCS_MASK)

/*!
 * @brief MTPNV status register, non-volatile memory programming enable macros.
 */
#define UJA113X_MTPNVS_NVMPS_MASK       (0x01U)
#define UJA113X_MTPNVS_NVMPS_SHIFT      (0U)
#define UJA113X_MTPNVS_NVMPS_F(x)       ((uint8_t)((uint8_t)(x) << UJA113X_MTPNVS_NVMPS_SHIFT) & \
										UJA113X_MTPNVS_NVMPS_MASK)

/*!
 * @brief   MTPNV status register macros.
 */
#define UJA113X_MTPNVS_MASK             (UJA113X_MTPNVS_WRCNTS_MASK | UJA113X_MTPNVS_ECCS_MASK | \
                                        UJA113X_MTPNVS_NVMPS_MASK)
#define UJA113X_MTPNVS_SHIFT            (0U)
#define UJA113X_MTPNVS_F(x)             ((uint8_t)((uint8_t)(x) << UJA113X_MTPNVS_SHIFT) & \
										UJA113X_MTPNVS_MASK)

