OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_uja113x/include/sbc_uja113x_map.h
/*******************************************************************************
 * HVIO high-side and low-side driver control register (0x71, 0x72)
 ******************************************************************************/
/*!
 * @brief HVIO high-side and low-side driver control register, HVIO8 high-side
 * and low-side driver control macros.
 */
#define UJA113X_IOHLDC_IO8HLOC_MASK     (0x80U)
#define UJA113X_IOHLDC_IO8HLOC_SHIFT    (7U)
#define UJA113X_IOHLDC_IO8HLOC_F(x)     ((uint8_t)((uint8_t)(x) << UJA113X_IOHLDC_IO8HLOC_SHIFT) & \
										UJA113X_IOHLDC_IO8HLOC_MASK)

/*!
 * @brief HVIO high-side and low-side driver control register, HVIO7 high-side
 * and low-side driver control macros.
 */
#define UJA113X_IOHLDC_IO7HLOC_MASK     (0x40U)
#define UJA113X_IOHLDC_IO7HLOC_SHIFT    (6U)
#define UJA113X_IOHLDC_IO7HLOC_F(x)     ((uint8_t)((uint8_t)(x) << UJA113X_IOHLDC_IO7HLOC_SHIFT) & \
										UJA113X_IOHLDC_IO7HLOC_MASK)

/*!
 * @brief HVIO high-side and low-side driver control register, HVIO6 high-side
 * and low-side driver control macros.
 */
#define UJA113X_IOHLDC_IO6HLOC_MASK     (0x20U)
#define UJA113X_IOHLDC_IO6HLOC_SHIFT    (5U)
#define UJA113X_IOHLDC_IO6HLOC_F(x)     ((uint8_t)((uint8_t)(x) << UJA113X_IOHLDC_IO6HLOC_SHIFT) & \
										UJA113X_IOHLDC_IO6HLOC_MASK)

/*!
 * @brief HVIO high-side and low-side driver control register, HVIO5 high-side
 * and low-side driver control macros.
 */
#define UJA113X_IOHLDC_IO5HLOC_MASK     (0x10U)
#define UJA113X_IOHLDC_IO5HLOC_SHIFT    (4U)
#define UJA113X_IOHLDC_IO5HLOC_F(x)     ((uint8_t)((uint8_t)(x) << UJA113X_IOHLDC_IO5HLOC_SHIFT) & \
										UJA113X_IOHLDC_IO5HLOC_MASK)

/*!
 * @brief HVIO high-side and low-side driver control register, HVIO4 high-side
 * and low-side driver control macros.
 */
#define UJA113X_IOHLDC_IO4HLOC_MASK     (0x08U)
#define UJA113X_IOHLDC_IO4HLOC_SHIFT    (3U)
#define UJA113X_IOHLDC_IO4HLOC_F(x)     ((uint8_t)((uint8_t)(x) << UJA113X_IOHLDC_IO4HLOC_SHIFT) & \
										UJA113X_IOHLDC_IO4HLOC_MASK)

/*!
 * @brief HVIO high-side and low-side driver control register, HVIO3 high-side
 * and low-side driver control macros.
 */
#define UJA113X_IOHLDC_IO3HLOC_MASK     (0x04U)
#define UJA113X_IOHLDC_IO3HLOC_SHIFT    (2U)
#define UJA113X_IOHLDC_IO3HLOC_F(x)     ((uint8_t)((uint8_t)(x) << UJA113X_IOHLDC_IO3HLOC_SHIFT) & \
										UJA113X_IOHLDC_IO3HLOC_MASK)

/*!
 * @brief HVIO high-side and low-side driver control register, HVIO2 high-side
 * and low-side driver control macros.
 */
#define UJA113X_IOHLDC_IO2HLOC_MASK     (0x02U)
#define UJA113X_IOHLDC_IO2HLOC_SHIFT    (1U)
#define UJA113X_IOHLDC_IO2HLOC_F(x)     ((uint8_t)((uint8_t)(x) << UJA113X_IOHLDC_IO2HLOC_SHIFT) & \
										UJA113X_IOHLDC_IO2HLOC_MASK)

/*!
 * @brief HVIO high-side and low-side driver control register, HVIO1 high-side
 * and low-side driver control macros.
 */
#define UJA113X_IOHLDC_IO1HLOC_MASK     (0x01U)
#define UJA113X_IOHLDC_IO1HLOC_SHIFT    (0U)
#define UJA113X_IOHLDC_IO1HLOC_F(x)     ((uint8_t)((uint8_t)(x) << UJA113X_IOHLDC_IO1HLOC_SHIFT) & \
										UJA113X_IOHLDC_IO1HLOC_MASK)

/*!
 * @brief HVIO high-side and low-side driver control register macros.
 */
#define UJA113X_IOHLDC_MASK     		(UJA113X_IOHLDC_IO8HLOC_MASK | UJA113X_IOHLDC_IO7HLOC_MASK | \
										UJA113X_IOHLDC_IO6HLOC_MASK | UJA113X_IOHLDC_IO5HLOC_MASK | \
										UJA113X_IOHLDC_IO4HLOC_MASK | UJA113X_IOHLDC_IO3HLOC_MASK | \
										UJA113X_IOHLDC_IO2HLOC_MASK | UJA113X_IOHLDC_IO1HLOC_MASK
#define UJA113X_IOHLDC_SHIFT    		(0U)
#define UJA113X_IOHLDC_F(x)     		((uint8_t)((uint8_t)(x) << UJA113X_IOHLDC_SHIFT) & \
										UJA113X_IOHLDC_MASK)

/*******************************************************************************
 * Start-up control register (0x73)
 ******************************************************************************/
/*!
 * @brief Start-up control register, RSTN output reset pulse width macros.
 */
#define UJA113X_SC_RLC_MASK            	(0x30U)
#define UJA113X_SC_RLC_SHIFT           	(4U)
#define UJA113X_SC_RLC_F(x)            	((uint8_t)((uint8_t)(x) << UJA113X_SC_RLC_SHIFT) & \
										UJA113X_SC_RLC_MASK)

/*!
 * @brief Start-up control register, V2 start-up control macros.
 */
#define UJA113X_SC_V2SUC_MASK          	(0x08U)
#define UJA113X_SC_V2SUC_SHIFT         	(3U)
#define UJA113X_SC_V2SUC_F(x)          	((uint8_t)((uint8_t)(x) << UJA113X_SC_V2SUC_SHIFT) & \
										UJA113X_SC_V2SUC_MASK)

/*!
 * @brief Start-up control register, HVIO4 configuration control macros.
 */
#define UJA113X_SC_IO4SFC_MASK         	(0x04U)
#define UJA113X_SC_IO4SFC_SHIFT         (2U)
#define UJA113X_SC_IO4SFC_F(x)          ((uint8_t)((uint8_t)(x) << UJA113X_SC_IO4SFC_SHIFT) & \
										UJA113X_SC_IO4SFC_MASK)

/*!
 * @brief Start-up control register, HVIO3 configuration control macros.
 */
#define UJA113X_SC_IO3SFC_MASK         	(0x02U)
#define UJA113X_SC_IO3SFC_SHIFT         (1U)
#define UJA113X_SC_IO3SFC_F(x)          ((uint8_t)((uint8_t)(x) << UJA113X_SC_IO3SFC_SHIFT) & \
										UJA113X_SC_IO3SFC_MASK)

/*!
 * @brief Start-up control register, HVIO2 configuration control macros.
 */
#define UJA113X_SC_IO2SFC_MASK         	(0x01U)
#define UJA113X_SC_IO2SFC_SHIFT         (0U)
#define UJA113X_SC_IO2SFC_F(x)          ((uint8_t)((uint8_t)(x) << UJA113X_SC_IO2SFC_SHIFT) & \
										UJA113X_SC_IO2SFC_MASK)

/*!
 * @brief Start-up control register macros.
 */
#define UJA113X_SC_MASK                	(UJA113X_SC_RLC_MASK | UJA113X_SC_V2SUC_MASK | \
										UJA113X_SC_IO4SFC_MASK | UJA113X_SC_IO3SFC_MASK | \
										UJA113X_SC_IO2SFC_MASK)
#define UJA113X_SC_SHIFT               	(0U)
#define UJA113X_SC_F(x)                	((uint8_t)((uint8_t)(x) << UJA113X_SC_SHIFT) & \
										UJA113X_SC_MASK)

/*******************************************************************************
 * SBC configuration control register (0x74)
 ******************************************************************************/
/*!
 * @brief SBC configuration control register, V1 undervoltage threshold
 * (defined by bit V1RTC) at start-up - macros.
 */
#define UJA113X_SCC_V1RTSUC_MASK        (0x30U)
#define UJA113X_SCC_V1RTSUC_SHIFT       (4U)
#define UJA113X_SCC_V1RTSUC_F(x)        ((uint8_t)((uint8_t)(x) << UJA113X_SCC_V1RTSUC_SHIFT) & \
										UJA113X_SCC_V1RTSUC_MASK)

/*!
 * @brief SBC configuration control register, Forced Normal mode control macros.
 */
#define UJA113X_SCC_FNMC_MASK           (0x08U)
#define UJA113X_SCC_FNMC_SHIFT          (3U)
#define UJA113X_SCC_FNMC_F(x)           ((uint8_t)((uint8_t)(x) << UJA113X_SCC_FNMC_SHIFT) & \
										UJA113X_SBC_FNMC_MASK)

/*!
 * @brief SBC configuration control register, Software Development mode control
 * macros.
 */
#define UJA113X_SCC_SDMC_MASK           (0x04U)
#define UJA113X_SCC_SDMC_SHIFT          (2U)
#define UJA113X_SCC_SDMC_F(x)           ((uint8_t)((uint8_t)(x) << UJA113X_SCC_SDMC_SHIFT) & \
										UJA113X_SBC_SDMC_MASK)

/*!
 * @brief SBC configuration control register, regulator V2 control
 * macros.
 */
#define UJA113X_SCC_VEXTAC_MASK         (0x02U)
#define UJA113X_SCC_VEXTAC_SHIFT        (1U)
#define UJA113X_SCC_VEXTAC_F(x)         ((uint8_t)((uint8_t)(x) << UJA113X_SCC_VEXTAC_SHIFT) & \
										UJA113X_SBC_VEXTAC_MASK)

/*!
 * @brief SBC configuration control register, Sleep control macros.
 */
#define UJA113X_SCC_SLPC_MASK           (0x01U)
#define UJA113X_SCC_SLPC_SHIFT          (0U)
#define UJA113X_SCC_SLPC_F(x)           ((uint8_t)((uint8_t)(x) << UJA113X_SCC_SLPC_SHIFT) & \
										UJA113X_SCC_SLPC_MASK)

/*!
 * @brief SBC configuration control register macros.
 */
#define UJA113X_SCC_MASK                (UJA113X_SCC_V1RTSUC_MASK | UJA113X_SCC_FNMC_MASK | \
                                        UJA113X_SCC_SDMC_MASK| UJA113X_SCC_VEXTAC_MASK | \
										UJA113X_SBC_SLPC_MASK)
#define UJA113X_SCC_SHIFT               (0U)
#define UJA113X_SCC_F(x)                ((uint8_t)((uint8_t)(x) << UJA113X_SCC_SHIFT) & \
										UJA113X_SCC_MASK)

