OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_uja113x/include/sbc_uja113x_map.h
/*******************************************************************************
 * MTPVN CRC control register (0x75)
 ******************************************************************************/
/*!
 * @brief MTPNV CRC control register, CRC control data macros.
 */
#define UJA113X_MCRCC_CRCC_MASK         (0xFFU)
#define UJA113X_MCRCC_CRCC_SHIFT        (0U)
#define UJA113X_MCRCC_CRCC_F(x)         ((uint8_t)((uint8_t)(x) << UJA113X_MCRCC_CRCC_SHIFT) & \
										UJA113X_MTPNV_CRC_MASK)

/*******************************************************************************
 * Identification register 1 (0x7E)
 ******************************************************************************/
/*!
 * @brief Identification register 1, device identification code (part 1) macros.
 */
#define UJA113X_ID1_ID0S_MASK           (0xFFU)
#define UJA113X_ID1_ID0S_SHIFT          (0U)
#define UJA113X_ID1_ID0S_F(x)           ((uint8_t)((uint8_t)(x) << UJA113X_ID1_ID0S_SHIFT) & \
										UJA113X_ID1_ID0S_MASK)

/*******************************************************************************
 * Identification register 2 (0x7F)
 ******************************************************************************/
/*!
 * @brief Identification register 2, device identification code (part 2) macros.
 */
#define UJA113X_ID2_ID1S_MASK           (0xC0U)
#define UJA113X_ID2_ID1S_SHIFT          (6U)
#define UJA113X_ID2_ID1S_F(x)           ((uint8_t)((uint8_t)(x) << UJA113X_ID2_ID1S_SHIFT) & \
										UJA113X_ID2_ID1S_MASK)

/*!
 * @brief Identification register 2, silicon version macros.
 */
#define UJA113X_ID2_IDVS_MASK           (0x3FU)
#define UJA113X_ID2_IDVS_SHIFT          (0U)
#define UJA113X_ID2_IDVS_F(x)           ((uint8_t)((uint8_t)(x) << UJA113X_ID2_IDVS_SHIFT) & \
										UJA113X_ID2_IDVS_MASK)

#endif /* SBC_UJA113X_MAP_H_ */
